class NavbarComponent extends HTMLElement {
  constructor() {
    super();
    this.attachShadow({ mode: 'open' });
  }

  connectedCallback() {
    this.render();
    this.setupDropdowns();
    this.setupNavbarHover();
    const links = this.shadowRoot.querySelectorAll('li');
    const path = window.location.pathname;
    links.forEach((link) => {
      const a = link.querySelector('a');
      if (a && path.endsWith(a.getAttribute('href').split('/').pop())) {
        link.classList.add('active');
      }
    });
  }

  setupDropdowns() {
    const dropdowns = this.shadowRoot.querySelectorAll('.dropdown');
    dropdowns.forEach((dropdown) => {
      const content = dropdown.querySelector('.dropdown-content');
      let timeoutId;

      dropdown.addEventListener('mouseenter', () => {
        clearTimeout(timeoutId);
        content.style.display = 'block';
      });

      dropdown.addEventListener('mouseleave', () => {
        timeoutId = setTimeout(() => {
          content.style.display = 'none';
        }, 100); // 300ms 延迟
      });
    });
  }

  setupNavbarHover() {
    const navbar = this.shadowRoot.querySelector('.navbar');
    let navbarTimeoutId;

    document.addEventListener('mousemove', (e) => {
      const rect = navbar.getBoundingClientRect();
      const isHovering = e.clientY <= rect.bottom && e.clientY >= rect.top;

      // 检查是否在页面顶部区域
      const topContainer = document.querySelector('.top-container');
      const header = document.querySelector('header');
      const isInTopArea =
        (topContainer &&
          e.clientY <= topContainer.getBoundingClientRect().bottom) ||
        (header && e.clientY <= header.getBoundingClientRect().bottom);

      clearTimeout(navbarTimeoutId);

      if (isHovering || isInTopArea) {
        navbar.style.opacity = '1';
      } else {
        navbarTimeoutId = setTimeout(() => {
          navbar.style.opacity = '0';
        }, 500);
      }
    });
  }

  render() {
    this.shadowRoot.innerHTML = `
    <style>
    * {
        margin: 0;
        padding: 0;
        text-decoration: none;
        list-style: none;
        box-sizing: border-box;
        transition: all 0.3s ease;
    }

    html{
      font-size: 12px;
    }

    @font-face {
      font-family: 'fangfang';
      src: url('/assets/fonts/字魂100号-方方先锋体.ttf') format('truetype');
      font-weight: 400;
    }

    .navbar {
      width: 100%;
      position: fixed;
      top: 0;
      margin-top: 1.5rem;
      z-index: 100;
      opacity: 0;
      transform: translateY(0);
    }

  
    .navbar ul{
      width: 60%;
      height: 60px;
      margin: 0 auto;
      border-radius: 200px;
      background: rgba(255, 255, 255, 0.7);
      box-shadow: 0px 8px 24px -5px rgba(0, 0, 0, 0.15); 
      display: flex;
      justify-content:space-evenly;
      align-items: center;
    }

    .navbar ul li{
      padding: 0.8rem;
      font-family: 'fangfang';
      border-radius: 50px;
      font-size: 1.8rem;
      position: relative;
    }

    .navbar ul li a{
      color: #462204;
    }

    // .navbar ul li:hover,
    // .navbar ul li.active{
    //   background-color: #137C41;
    // }

    .navbar ul li:hover>a,
    .navbar ul li.active>a{
      // color: #F9F1D4; 
      color: #137C41;
    }

    .dropdown {
      position: relative;

    }

    .dropdown-content {
      display: none;
      position: absolute;
      top: 100%;
      left: 50%;
      transform: translateX(-50%);
      min-width: 160px;
      border-radius: 10px;
      box-shadow: 0px 8px 24px -5px rgba(0, 0, 0, 0.15);
      padding: 0.5rem 0;
      margin-top: 0.6rem;
      // background: linear-gradient(172.42deg, #FFFFFF 25.07%,rgba(224, 189, 113, 0.59) 210.14%, #765610 262.98%);
      background:rgba(252, 252, 251, 0.72);
      transition: opacity 0.5s ease;
    }

    .dropdown-content a {
      color: #462204;
      padding: 0.8rem 1.5rem;
      display: block;
      font-size: 1.4rem;
      text-align: center;
      cursor: pointer;
      border-bottom: 1px solid rgba(235, 235, 235, 1);
    }

    .dropdown-content a:last-child {
      border-bottom: none;
    }

    .dropdown-content a:hover {
      color: #137C41;
    }
    </style>
      <nav class="navbar">
        <ul>
          <li class="dropdown">
            <a href="../pages/start.html" class="dropdown-trigger">首页</a>
            </li>
          <li class="dropdown">
            <a href="../pages/origin.html" class="dropdown-trigger">根·起源</a>
            <div class="dropdown-content">
              <a href="../pages/origin.html#change">农业变迁</a>
              <a href="../pages/origin.html#landMemory">土地记忆拼图</a>
              <a href="../pages/origin.html#plow">耕织图</a>
            </div>
          </li>
          <li class="dropdown">
            <a href="../pages/coexistence.html" class="dropdown-trigger">苦·共生</a>
            <div class="dropdown-content">
              <a href="../pages/coexistence.html#disater">灾年记忆</a>
              <a href="../pages/coexistence.html#plowMan">耕路人</a>
              <a href="../pages/coexistence.html#heart">农民心声</a>
              <a href="../pages/coexistence.html#season">二十四节气</a>
            </div>
          </li>
          <li class="dropdown">
            <a href="../pages/wish.html" class="dropdown-trigger">新·生长</a>
            <div class="dropdown-content">
              <a href="../pages/wish.html#future">耕今与昔</a>
              <a href="../pages/wish.html#development">政策树</a>
              <a href="../pages/wish.html#new">新农人</a>
            </div>
          </li>
        </ul>
      </nav>
    `;
  }
}

class TitleComponent extends HTMLElement {
  constructor() {
    super();
    this.attachShadow({ mode: 'open' });
  }

  static get observedAttributes() {
    return ['main-title', 'sub-title'];
  }

  connectedCallback() {
    this.render();
  }

  attributeChangedCallback(_, oldValue, newValue) {
    if (oldValue !== newValue) {
      this.render();
    }
  }

  render() {
    const mainTitle = this.getAttribute('main-title');
    const subTitle = this.getAttribute('sub-title');

    this.shadowRoot.innerHTML = `
    <style>
    * {
  margin: 0;
  padding: 0;
  text-decoration: none;
  list-style: none;
  box-sizing: border-box;
  transition: all 0.5s;
}

html{
  font-size: 12px;
}
@font-face {
  font-family: 'fangfang';
  src: url('/assets/fonts/字魂100号-方方先锋体.ttf') format('truetype');
  font-weight: 400;
}
  .title {
  font-family: 'fangfang';
  line-height: 100%;
  font-size: 4rem;
  letter-spacing: -1.1%;
  color: #462204;
  margin-left: 8rem;
  position: relative;
}
h6{
  padding: 0;
   font-size: 2rem;
  opacity: 0.7;
  transform: translateY(-2rem);
  }
.title > div,
h5 + span {
  display: flex;
  align-items: center;
}
  .title img{
  scale:0.8
  }
    </style>
     <div class="title">
              <div>
                <h5>${mainTitle}</h5>
                <span>
                 <img src="../assets/imgs/title-icon.svg" alt="title-icon">
                </span>
              </div>
              <h6>${subTitle}</h6>
            </div>
    `;
  }
}

class AgriculturalChangeComponent extends HTMLElement {
  constructor() {
    super();
    this.attachShadow({ mode: 'open' });
    this.currentIndex = 0;
    this.throttleTimeout = 300;
    // 添加颜色配置
    this.colors = {
      0: {
        group1: ['#FCC62D', '#E2B23B', '#FFD24D'], // 第一组 - 黄色、橙色、金色
        group2: ['#137C41', '#137C41', '#137C41'], // 第二组 - 绿色
        group3: ['#137C41', '#137C41', '#137C41'], // 第三组 - 绿色
        group4: ['#137C41', '#137C41', '#137C41'], // 第四组 - 绿色
      },
      1: {
        group1: ['#137C41', '#137C41', '#137C41'], // 第一组 - 绿色
        group2: ['#FCC62D', '#E2B23B', '#FFD24D'], // 第二组 - 黄色、橙色、金色
        group3: ['#137C41', '#137C41', '#137C41'], // 第三组 - 绿色
        group4: ['#137C41', '#137C41', '#137C41'], // 第四组 - 绿色
      },
      2: {
        group1: ['#137C41', '#137C41', '#137C41'], // 第一组 - 绿色
        group2: ['#137C41', '#137C41', '#137C41'], // 第二组 - 绿色
        group3: ['#FCC62D', '#E2B23B', '#FFD24D'], // 第三组 - 黄色、橙色、金色
        group4: ['#137C41', '#137C41', '#137C41'], // 第四组 - 绿色
      },
      3: {
        group1: ['#137C41', '#137C41', '#137C41'], // 第一组 - 绿色
        group2: ['#137C41', '#137C41', '#137C41'], // 第二组 - 绿色
        group3: ['#137C41', '#137C41', '#137C41'], // 第三组 - 绿色
        group4: ['#FCC62D', '#E2B23B', '#FFD24D'], // 第四组 - 黄色、橙色、金色
      },
    };
    this.changeContent = [
      {
        imgs: '../assets/imgs/origin/agricultural-change-1.png',
        profile:
          '原始农业系由 采集 、狩猎逐步过渡而来的一种近似 自然状态 的农业，属世界农业发展的最初阶段。 原始农业，其特征是使用简陋的石制工具，采用粗放的刀耕火种的 耕作方法，实行以 简单协作 为主的集体劳动。 大约在距今12000年前，中国的 新石器时代 早期阶段出现了原始农业的雏形，进入原始农业的重大 技术突破 是驯化 野生植物 和动物，标志是 稻谷 和陶器的出现。',
        method:
          '砍倒之后便是烧光和播种。这种情况在中国古史传说中得到映证。相传"烈山氏"之子曰柱，为稷，自夏以上祀之。"烈山"就是放火烧山，"柱"实际上是挖洞点种的尖头木棒——后来发展为木耒。这正是原始农业中两个相互连接的主要作业，不过被传说人格化了。 刀耕火种一般不施肥，也不中耕，所以种植二三年之后就要另觅新地重新砍烧种植，农史学家称之为"游耕"。但从新石器时代所出土的一些实物来看，中国一些地区的原始农业似乎在六七千年以前，很早就脱离了早期的刀耕火种阶段。而已由"原始生荒耕作制"阶段，进入了所谓"锄耕"或耜耕"的"熟荒耕作制"的阶段。 河姆渡遗址出土的大片木结构建筑遗迹、大量的骨耜、成堆的稻谷稻壳，以及半坡、姜寨由几个氏族建立的五万多平方米面积的部落村庄遗址来看，人们已过着较长期的定居生活。人们在几块土地上，轮流倒换种植，不必经常流动到别处去重新开荒。这就能导致较长期的定居生活，有利于农业的发展。 这时期的遗址中还出土有大量不同类型的农业生产工具，其中石铲、石锛、石耜和骨耜都为翻土的工具，石锄、蚌锄和有两翼的石耘田器用于中耕除草。石镰、蚌镰、骨镰、穿孔半月形石刀等收割工具，不但提高了收割效率，而且能连杆收割，这种收割方法为饲养家畜储备了必要的饲料。石磨棒则是谷物脱壳的工具。河姆渡还出土可能已驯化的水牛遗骨化石，据此有人甚至认为，河姆渡的先民可能已使用了牛踏田这样的一种整田方式。',
      },
      {
        imgs: '../assets/imgs/origin/agricultural-change-2.png',
        profile:
          '传统农业是在自然经济条件下，采用人力、畜力、手工工具、铁器等为主的手工劳动方式，靠世代积累下来的传统经验发展，以自给自足的自然经济居主导地位的农业。 传统农业是一种生计农业,农产品有限,家庭成员参加生产劳动并进行家庭内部分工，农业生产多靠经验积累,生产方式较为稳定。 传统农业生产水平低、剩余少、积累慢,产量受自然环境条件影响大。 在不同学科领域中，传统农业有着不同的分类方式。',
        method:
          '中国传统农业延续的时间十分长久，大约在战国、秦汉之际已逐渐形成一套以精耕细作为特点的传统农业技术。在其发展过程中，生产工具和生产技术尽管有很大的改进和提高，但就其主要特征而言，没有根本性质的变化。中国传统农业技术的精华，对世界农业的发展有过积极的影响。重视、继承和发扬传统农业技术，使之与现代农业技术合理地结合，对加速发展农业生产，建设农业现代，具有十分重要的意义。',
      },
      {
        imgs: '../assets/imgs/origin/agricultural-change-3.png',
        profile:
          '近代农业是指经济发达国家19世纪后期到20世纪40年代的农业。基本特征有： 主要生产工具是畜力牵引的半机械化农具，脱谷机、拖拉机等一些复杂的农业机器在少数地区和企业里开始使用；由于植物学、动物学、遗传学、化学、物理学等自然科学成果在农业领域的广泛运用，使土壤改良、育种、栽培、饲养、植物保护等生产活动由凭借直接经验开始转向依靠科学指导；农业生产的社会分工发展起来，打破自然经济的狭隘界限，从事商品生产的农业企业逐步成为主要的农业经营形式。',
        method:
          '中国近代农业的发展处于传统农业向现代农业的过渡阶段，呈现出传统与现代并存的特点。在这一时期，西方农业作物与技术逐步传入，如玉米、马铃薯等高产作物在中国广泛种植，部分地区试用机械化工具，农业科技教育初步兴起。同时，农业生产依旧以小农经营为主，技术落后、依赖自然，农村经济饱受战乱与自然灾害影响。尽管各类改良措施推进缓慢，但农业合作尝试和科技探索为日后农业现代化奠定了基础。',
      },
      {
        imgs: '../assets/imgs/origin/agricultural-change-4.png',
        profile:
          '现代农业是在现代工业和现代科学技术基础上发展起来的农业，是萌发于资本主义工业化时期，而在第二次世界大战以后才形成的发达农业。其主要特征是广泛地运用现代科学技术，由顺应自然变为自觉地利用自然和改造自然，由凭借传统经验变为依靠科学，成为科学化的农业，使其建立在植物学、动物学、化学、物理学等科学高度发展的基础上；把工业部门生产的大量物质和能量投入到农业生产中，以换取大量农产品，成为工业化的农业；农业生产走上了区域化、专业化的道路，由自然经济变为高度发达的商品经济，成为商品化、社会化的农业。',
        method:
          '一整套建立在现代自然科学基础上的农业科学技术的形成和推广，使农业生产技术由经验转向科学，如在植物学、动物学、遗传学、物理学、化学等科学发展的基础上，育种、栽培、饲养、土壤改良、植保畜保等农业科学技术得到了迅速提高和广泛应用。 现代机器体系的形成和农业机器的的广泛应用，使农业由手工畜力农具生产转变为机器生产，如技术经济性能优良的拖拉机、耕耘机、联合收割机、农用汽车、农用飞机以及林、牧、渔业中的各种机器，成为农业的主要生产工具，使投入农业的能源显著增加，电子、原子能、激光、遥感技术以及人造卫星等也开始运用于农业；良好的、高效能的生态系统逐步形成。 农业生产的社会化程度有很大提高，如农业企业规模的扩大，农业生产的地区分工、企业分工日益发达，"小而全"的自给自足生产被高度专业化、商品化的生产所代替，农业生产过程同加工、销售以及生产资料的制造和供应紧密结合，产生了农工商一体化。经济数学方法、电子计算机等现代科学技术在现代农业企业管理和宏观管理中运用越来越广，管理方法显著改进。 现代农业的产生和发展，大幅度地提高了农业劳动生产率、土地生产率和农产品商品率，使农业生产、农村面貌和农户行为发生了重大变化。',
      },
    ];
  }

  // 添加节流函数
  throttle(func, delay) {
    if (this.isScrolling) return;
    this.isScrolling = true;
    func();
    setTimeout(() => {
      this.isScrolling = false;
    }, delay);
  }

  connectedCallback() {
    this.render();
    this.addEventListeners();
    this.updateContent(); // 确保首次加载时更新内容
  }

  addEventListeners() {
    // 添加 flat-text span 元素的点击事件监听
    const flatTextSpans = this.shadowRoot.querySelectorAll('.flat-text span');
    flatTextSpans.forEach((span, index) => {
      span.addEventListener('click', () => {
        if (index !== this.currentIndex) {
          this.currentIndex = index;
          this.updateContent();
        }
      });
    });
  }

  updateContent() {
    const item = this.changeContent[this.currentIndex];
    const svgPaths = this.shadowRoot.querySelectorAll('svg path');
    const content = this.shadowRoot.querySelector('.content-container');
    console.log(svgPaths);

    // 更新内容
    content.innerHTML = `
     <div>
       <img src="${item.imgs}" alt="agricultural-change-${
      this.currentIndex + 1
    }" />
     </div>
     <div class="agricultural-change-content-text-container">
       <div class="agricultural-change-content-text">
         <h6>简介</h6>
         <div class="text-wrapper">
           <p class="paragraph-1 expanded">${item.profile}</p>
         </div>
         <h6>种植方式</h6>
         <div class="text-wrapper">
           <p class="paragraph-2 expanded">${item.method}</p>
         </div>
       </div>
     </div>
   `;

    // 更新特定 SVG 路径颜色
    const group1 = [5, 6, 7];
    const group2 = [13, 14, 15];
    const group3 = [21, 22, 23];
    const group4 = [29, 30, 31];

    // 更新第一组
    group1.forEach((index, i) => {
      if (svgPaths[index]) {
        svgPaths[index].setAttribute(
          'fill',
          this.colors[this.currentIndex].group1[i]
        );
      }
    });

    // 更新第二组
    group2.forEach((index, i) => {
      if (svgPaths[index]) {
        svgPaths[index].setAttribute(
          'fill',
          this.colors[this.currentIndex].group2[i]
        );
      }
    });

    // 更新第三组
    group3.forEach((index, i) => {
      if (svgPaths[index]) {
        svgPaths[index].setAttribute(
          'fill',
          this.colors[this.currentIndex].group3[i]
        );
      }
    });

    // 更新第四组
    group4.forEach((index, i) => {
      if (svgPaths[index]) {
        svgPaths[index].setAttribute(
          'fill',
          this.colors[this.currentIndex].group4[i]
        );
      }
    });

    // 获取所有 path 元素并设置 pointer-events 为 none
    const paths = this.shadowRoot.querySelectorAll('path');
    paths.forEach((path) => {
      path.style.pointerEvents = 'none';
    });

    // 获取所有 <circle> 元素
    const circles = this.shadowRoot.querySelectorAll('circle');

    // 遍历每一个 <circle> 元素，根据 currentIndex 设置透明度
    circles.forEach((circle, index) => {
      circle.addEventListener('click', () => {
        if (index !== this.currentIndex) {
          this.currentIndex = index;
          this.updateContent();
        }
      });
      const opacity = index === this.currentIndex ? 1 : 0; // 只有当前索引的 <circle> 不透明
      circle.setAttribute('fill-opacity', opacity);
    });

    // 获取所有 <span> 元素
    const spans = this.shadowRoot.querySelectorAll('.flat-text span');

    // 遍历每一个 <span> 元素，根据 currentIndex 设置字体颜色
    spans.forEach((span, index) => {
      const color = index === this.currentIndex ? '#137C41' : '';
      span.style.color = color;
    });
  }

  render() {
    this.shadowRoot.innerHTML = `
      <style>
        * {
          margin: 0;
          padding: 0;
          text-decoration: none;
          list-style: none;
          box-sizing: border-box;
          transition: all 0.3s;
        }
        .agricultural-change-content {
          position: relative;
          z-index: 10;
          width: 100%;
          display: flex;
          justify-content: center;
        }
        .content-container {
          display: grid;
          grid-template-columns: 50rem 50rem;
          margin: 2rem auto;
          position: relative;
        }

        .content-container img {
          width: 50rem;
          height: 34rem;
          border-radius: 16rem;
          cursor:pointer;
          object-fit: cover;
        }

        .agricultural-change-content-text-container {
          display: flex;
          justify-content:flex-end;
        }

        .agricultural-change-content-text {
          width: 90%;
          font-size: 1.5rem;
          margin-right: 2rem;
          margin-left: 6rem;
          color: #462204;
          display: flex;
          flex-direction: column;
          gap: 1rem;
          justify-content:flex-start;
          cursor:pointer;
          height: 34rem;
          overflow-y: auto;
          padding-right: 1rem;
        }
        circle { 
        cursor:pointer;
        position: relative;
        z-index: 20;
        }
        .agricultural-change-content-text h6 {
          font-size: 2rem;
          font-family: 'PingFang-SC-Semibold';
          line-height: 118%;
          letter-spacing: -1.1%;
        }

        .agricultural-change-content-text p {
          opacity: 0.7;
          font-family: 'PingFang-SC-Regular';
          line-height: 144%;
          letter-spacing: -1.1%;
        }
.agricultural-change-content-text::-webkit-scrollbar {
  width: 12px;
}
.agricultural-change-content-text::-webkit-scrollbar-track {
  background: #137c41;
  border-radius: 8px;
}
.agricultural-change-content-text::-webkit-scrollbar-thumb {
  background: #f3e46c;
  border-radius: 8px;

}
  .scroll-flat {
  width: 100%;
  display: flex;
  justify-content: center;
  align-items: center;
  position: relative;
  margin-top: 2rem;
}
.scroll-flat svg {
  z-index: 10;
}

        .text-wrapper {
          position: relative;
          width: 100%;
        }


    .flat-detail {
  width: 100%;
  margin-top: 1rem;
}
.flat-text {
  margin: 0 auto;
  width: 85.5rem;
  text-align: center;
  display: flex;
  justify-content: space-between;
  font-family: PingFang-SC-Semibold;
  font-weight: 600;
  font-size: 2rem;
  line-height: 118%;
  letter-spacing: -1.1%;
  color: #462204;
  position:relative;
  z-index:100;
 
}
 .flat-text{
  cursor: pointer;
  }
  

      </style>
    <div class="agricultural-change-content">
      <div class="content-container">
        <div>
          <img src="${this.changeContent[0].imgs}" alt="agricultural-change-1" />
        </div>
        <div class="agricultural-change-content-text-container">
          <div class="agricultural-change-content-text">
            <h6>简介</h6>
            <div class="text-wrapper">
              <p>${this.changeContent[0].profile}</p>
            </div>
            <h6>种植方式</h6>
            <div class="text-wrapper">
              <p>${this.changeContent[0].method}</p>
            </div>
          </div>
        </div>
      </div>
    </div>
            <!-- 横向滚动条 -->
          <div class="scroll-flat">
              <svg
                width="968"
                height="65"
                viewBox="0 0 968 65"
                fill="none"
                xmlns="http://www.w3.org/2000/svg">
                  //1
                <circle cx="32" cy="32" r="32" fill="#137C41"/>
                <path
                  d="M61.0089 43.1256C60.8388 43.1437 60.6679 43.1009 60.5263 43.0049C60.3299 42.9467 60.1475 42.8487 59.9905 42.7171C59.8335 42.5854 59.7052 42.423 59.6135 42.2397C59.5219 42.0565 59.4689 41.8563 59.4578 41.6517C59.4467 41.4471 59.4777 41.2424 59.549 41.0503C61.2448 35.957 61.4801 30.4905 60.2283 25.2703C58.9765 20.0501 56.2877 15.2848 52.4663 11.5144C47.5275 6.65986 41.0269 3.71437 34.1205 3.20182C27.2142 2.68928 20.3499 4.64291 14.7486 8.71525C14.5939 8.86746 14.4079 8.98417 14.2035 9.05731C13.9992 9.13046 13.7814 9.15828 13.5652 9.13883C13.3491 9.11938 13.1397 9.05316 12.9517 8.94472C12.7637 8.83627 12.6015 8.6882 12.4765 8.51082C12.3514 8.33344 12.2664 8.13093 12.2275 7.91742C12.1885 7.70392 12.1964 7.48452 12.2507 7.27439C12.305 7.06426 12.4044 6.86846 12.542 6.70058C12.6795 6.5327 12.8519 6.39676 13.0473 6.30218C19.1953 1.73167 26.7824 -0.474878 34.4228 0.0855579C42.0632 0.645993 49.2471 3.93605 54.6623 9.35475C58.8512 13.5576 61.7894 18.842 63.1487 24.6179C64.5081 30.3939 64.2351 36.4341 62.3603 42.0639C62.2998 42.3735 62.1301 42.6511 61.882 42.846C61.634 43.0409 61.3241 43.1401 61.0089 43.1256Z"
                  fill="#137C41" />
                <path
                  d="M31.9657 64.1192C31.2316 64.1398 30.4971 64.0995 29.7698 63.9986C22.0813 63.4459 14.8461 60.1538 9.37853 54.7204C3.88674 49.3032 0.583481 42.0527 0.0999172 34.3541C-0.506457 26.7323 1.66177 19.148 6.20522 12.9984C6.2998 12.8031 6.43574 12.6306 6.60363 12.4931C6.77152 12.3555 6.96733 12.2562 7.17746 12.2019C7.3876 12.1476 7.60705 12.1396 7.82056 12.1786C8.03407 12.2176 8.23652 12.3025 8.41391 12.4276C8.5913 12.5527 8.73937 12.7148 8.84782 12.9028C8.95627 13.0908 9.02253 13.3002 9.04198 13.5163C9.06143 13.7325 9.0336 13.9503 8.96046 14.1546C8.88731 14.359 8.7706 14.5449 8.61838 14.6996C4.46164 20.2759 2.45081 27.1618 2.95354 34.0985C3.45628 41.0353 6.439 47.5594 11.3563 52.478C16.2737 57.3966 22.7971 60.3812 29.734 60.8859C36.6709 61.3907 43.5577 59.382 49.1354 55.2271C49.2926 55.0964 49.475 54.9996 49.6714 54.9427C49.8677 54.8858 50.0738 54.8701 50.2765 54.8966C50.4792 54.923 50.6742 54.9911 50.8494 55.0964C51.0246 55.2018 51.1761 55.3423 51.2945 55.509C51.4128 55.6757 51.4954 55.865 51.5372 56.0651C51.5789 56.2652 51.5789 56.4718 51.537 56.6719C51.4952 56.872 51.4124 57.0613 51.294 57.2279C51.1755 57.3945 51.024 57.5349 50.8487 57.6401C45.4644 61.866 38.8103 64.1491 31.9657 64.1192Z"
                  fill="#137C41" />
                <path
                  d="M31.9677 47.8909C31.5481 47.8817 31.1484 47.7109 30.8517 47.4142C30.555 47.1175 30.3842 46.7179 30.375 46.2984V38.9747C30.4096 38.5778 30.5918 38.2083 30.8855 37.9391C31.1793 37.6699 31.5632 37.5205 31.9617 37.5205C32.3601 37.5205 32.7441 37.6699 33.0378 37.9391C33.3315 38.2083 33.5137 38.5778 33.5483 38.9747V46.2984C33.5422 46.7168 33.374 47.1164 33.0792 47.4134C32.7845 47.7104 32.386 47.8816 31.9677 47.8909Z"
                  fill="#3C3B3D" />
                <path
                  d="M56.8535 50.4498C57.493 51.0893 57.9285 51.904 58.1049 52.791C58.2814 53.678 58.1908 54.5975 57.8447 55.433C57.4985 56.2686 56.9124 56.9827 56.1604 57.4852C55.4084 57.9876 54.5243 58.2558 53.6198 58.2558C52.7154 58.2558 51.8313 57.9876 51.0793 57.4852C50.3272 56.9827 49.7411 56.2686 49.395 55.433C49.0489 54.5975 48.9583 53.678 49.1347 52.791C49.3112 51.904 49.7467 51.0893 50.3862 50.4498C50.805 50.0148 51.3072 49.6687 51.8628 49.4323C52.4184 49.196 53.016 49.0742 53.6198 49.0742C54.2236 49.0742 54.8212 49.196 55.3769 49.4323C55.9325 49.6687 56.4347 50.0148 56.8535 50.4498Z"
                  fill="#A5C63B" />
                <path
                  d="M13.6503 7.24378C14.2898 7.8833 14.7254 8.69802 14.9018 9.58505C15.0782 10.4721 14.9877 11.3915 14.6415 12.2271C14.2954 13.0626 13.7093 13.7768 12.9573 14.2792C12.2053 14.7817 11.3211 15.0499 10.4167 15.0499C9.51227 15.0499 8.62815 14.7817 7.87614 14.2792C7.12412 13.7768 6.53798 13.0626 6.19186 12.2271C5.84574 11.3915 5.75518 10.4721 5.93161 9.58505C6.10804 8.69802 6.54356 7.8833 7.18307 7.24378C7.60183 6.80879 8.10405 6.46271 8.65967 6.22635C9.21529 5.99 9.81289 5.86816 10.4167 5.86816C11.0205 5.86816 11.6181 5.99 12.1737 6.22635C12.7294 6.46271 13.2316 6.80879 13.6503 7.24378Z"
                  fill="#70993F" />
                <path
                  d="M35.743 29.8298C33.5889 32.1099 32.4074 35.1392 32.4491 38.2756H32.2077C32.2494 35.1392 31.0679 32.1099 28.9137 29.8298C28.3328 29.265 27.7205 28.7332 27.0798 28.2372C26.591 26.9081 26.3419 25.5028 26.3438 24.0867C26.3986 22.02 26.9355 19.9947 27.9117 18.1723C28.8879 16.3499 30.2764 14.7807 31.9664 13.5898C33.6639 14.7724 35.0572 16.34 36.0324 18.1645C37.0076 19.989 37.5369 22.0184 37.577 24.0867C37.5959 25.465 37.3459 26.8339 36.841 28.1166L37.0944 28.3579C36.5997 28.9732 36.117 29.3351 35.743 29.8298Z"
                  fill="#FCC62D" />
                <path
                  d="M45.632 26.2827C46.0637 28.2034 46.0114 30.2013 45.4799 32.0968C44.9484 33.9923 43.9543 35.726 42.5869 37.1424C41.2196 38.5587 39.5219 39.6132 37.6462 40.2111C35.7705 40.8091 33.7756 40.9317 31.8408 40.5681C31.6986 39.7708 31.6139 38.9644 31.5874 38.155C31.5381 35.0172 32.7207 31.9851 34.8814 29.7093C35.3021 29.2749 35.7537 28.8717 36.2328 28.5027C39.0015 26.6671 42.3345 25.8798 45.632 26.2827Z"
                  fill="#E2B23B" />
                <path
                  d="M28.9183 29.8294C31.0725 32.1095 32.2539 35.1388 32.2123 38.2752C32.1959 39.0846 32.1152 39.8915 31.971 40.6882C30.0362 41.0519 28.0414 40.9293 26.1657 40.3314C24.29 39.7334 22.5922 38.6789 21.2249 37.2626C19.8575 35.8463 18.8635 34.1124 18.332 32.2169C17.8005 30.3214 17.7482 28.3236 18.1798 26.4028C21.3261 25.9252 24.5383 26.6209 27.205 28.3575C27.857 28.7453 28.4368 29.2433 28.9183 29.8294Z"
                  fill="#FFD24D" />
                   //2
                 <circle cx="334" cy="32" r="32" fill="#137C41" fill-opacity="0"/>
                <path
                  d="M363.009 43.1256C362.839 43.1437 362.668 43.1009 362.526 43.0049C362.33 42.9467 362.147 42.8487 361.99 42.7171C361.833 42.5854 361.705 42.423 361.614 42.2397C361.522 42.0565 361.469 41.8563 361.458 41.6517C361.447 41.4471 361.478 41.2424 361.549 41.0503C363.245 35.957 363.48 30.4905 362.228 25.2703C360.977 20.0501 358.288 15.2848 354.466 11.5144C349.528 6.65986 343.027 3.71437 336.121 3.20182C329.214 2.68928 322.35 4.64291 316.749 8.71525C316.594 8.86746 316.408 8.98417 316.204 9.05731C315.999 9.13046 315.781 9.15828 315.565 9.13883C315.349 9.11938 315.14 9.05316 314.952 8.94472C314.764 8.83627 314.602 8.6882 314.476 8.51082C314.351 8.33344 314.266 8.13093 314.227 7.91742C314.188 7.70392 314.196 7.48452 314.251 7.27439C314.305 7.06426 314.404 6.86846 314.542 6.70058C314.68 6.5327 314.852 6.39676 315.047 6.30218C321.195 1.73167 328.782 -0.474878 336.423 0.0855579C344.063 0.645993 351.247 3.93605 356.662 9.35475C360.851 13.5576 363.789 18.842 365.149 24.6179C366.508 30.3939 366.235 36.4341 364.36 42.0639C364.3 42.3735 364.13 42.6511 363.882 42.846C363.634 43.0409 363.324 43.1401 363.009 43.1256Z"
                  fill="#137C41" />
                <path
                  d="M333.966 64.1192C333.232 64.1398 332.497 64.0995 331.77 63.9986C324.081 63.4459 316.846 60.1538 311.379 54.7204C305.887 49.3032 302.583 42.0527 302.1 34.3541C301.494 26.7323 303.662 19.148 308.205 12.9984C308.3 12.8031 308.436 12.6306 308.604 12.4931C308.772 12.3555 308.967 12.2562 309.177 12.2019C309.388 12.1476 309.607 12.1396 309.821 12.1786C310.034 12.2176 310.237 12.3025 310.414 12.4276C310.591 12.5527 310.739 12.7148 310.848 12.9028C310.956 13.0908 311.023 13.3002 311.042 13.5163C311.061 13.7325 311.034 13.9503 310.96 14.1546C310.887 14.359 310.771 14.5449 310.618 14.6996C306.462 20.2759 304.451 27.1618 304.954 34.0985C305.456 41.0353 308.439 47.5594 313.356 52.478C318.274 57.3966 324.797 60.3812 331.734 60.8859C338.671 61.3907 345.558 59.382 351.135 55.2271C351.293 55.0964 351.475 54.9996 351.671 54.9427C351.868 54.8858 352.074 54.8701 352.276 54.8966C352.479 54.923 352.674 54.9911 352.849 55.0964C353.025 55.2018 353.176 55.3423 353.294 55.509C353.413 55.6757 353.495 55.865 353.537 56.0651C353.579 56.2652 353.579 56.4718 353.537 56.6719C353.495 56.872 353.412 57.0613 353.294 57.2279C353.176 57.3945 353.024 57.5349 352.849 57.6401C347.464 61.866 340.81 64.1491 333.966 64.1192Z"
                  fill="#137C41" />
                <path
                  d="M333.968 47.8909C333.548 47.8817 333.148 47.7109 332.852 47.4142C332.555 47.1175 332.384 46.7179 332.375 46.2984V38.9747C332.41 38.5778 332.592 38.2083 332.886 37.9391C333.179 37.6699 333.563 37.5205 333.962 37.5205C334.36 37.5205 334.744 37.6699 335.038 37.9391C335.332 38.2083 335.514 38.5778 335.548 38.9747V46.2984C335.542 46.7168 335.374 47.1164 335.079 47.4134C334.784 47.7104 334.386 47.8816 333.968 47.8909Z"
                  fill="#3C3B3D" />
                <path
                  d="M358.853 50.4498C359.493 51.0893 359.928 51.904 360.105 52.791C360.281 53.678 360.191 54.5975 359.845 55.433C359.499 56.2686 358.912 56.9827 358.16 57.4852C357.408 57.9876 356.524 58.2558 355.62 58.2558C354.715 58.2558 353.831 57.9876 353.079 57.4852C352.327 56.9827 351.741 56.2686 351.395 55.433C351.049 54.5975 350.958 53.678 351.135 52.791C351.311 51.904 351.747 51.0893 352.386 50.4498C352.805 50.0148 353.307 49.6687 353.863 49.4323C354.418 49.196 355.016 49.0742 355.62 49.0742C356.224 49.0742 356.821 49.196 357.377 49.4323C357.932 49.6687 358.435 50.0148 358.853 50.4498Z"
                  fill="#A5C63B" />
                <path
                  d="M315.65 7.24378C316.29 7.8833 316.725 8.69802 316.902 9.58505C317.078 10.4721 316.988 11.3915 316.642 12.2271C316.295 13.0626 315.709 13.7768 314.957 14.2792C314.205 14.7817 313.321 15.0499 312.417 15.0499C311.512 15.0499 310.628 14.7817 309.876 14.2792C309.124 13.7768 308.538 13.0626 308.192 12.2271C307.846 11.3915 307.755 10.4721 307.932 9.58505C308.108 8.69802 308.544 7.8833 309.183 7.24378C309.602 6.80879 310.104 6.46271 310.66 6.22635C311.215 5.99 311.813 5.86816 312.417 5.86816C313.021 5.86816 313.618 5.99 314.174 6.22635C314.729 6.46271 315.232 6.80879 315.65 7.24378Z"
                  fill="#70993F" />
                <path
                  d="M337.743 29.8298C335.589 32.1099 334.407 35.1392 334.449 38.2756H334.208C334.249 35.1392 333.068 32.1099 330.914 29.8298C330.333 29.265 329.72 28.7332 329.08 28.2372C328.591 26.9081 328.342 25.5028 328.344 24.0867C328.399 22.02 328.936 19.9947 329.912 18.1723C330.888 16.3499 332.276 14.7807 333.966 13.5898C335.664 14.7724 337.057 16.34 338.032 18.1645C339.008 19.989 339.537 22.0184 339.577 24.0867C339.596 25.465 339.346 26.8339 338.841 28.1166L339.094 28.3579C338.6 28.9732 338.117 29.3351 337.743 29.8298Z"
                  fill="#137C41" />
                <path
                  d="M347.632 26.2827C348.064 28.2034 348.011 30.2013 347.48 32.0968C346.948 33.9923 345.954 35.726 344.587 37.1424C343.22 38.5587 341.522 39.6132 339.646 40.2111C337.77 40.8091 335.776 40.9317 333.841 40.5681C333.699 39.7708 333.614 38.9644 333.587 38.155C333.538 35.0172 334.721 31.9851 336.881 29.7093C337.302 29.2749 337.754 28.8717 338.233 28.5027C341.002 26.6671 344.335 25.8798 347.632 26.2827Z"
                  fill="#137C41" />
                <path
                  d="M330.918 29.8294C333.072 32.1095 334.254 35.1388 334.212 38.2752C334.196 39.0846 334.115 39.8915 333.971 40.6882C332.036 41.0519 330.041 40.9293 328.166 40.3314C326.29 39.7334 324.592 38.6789 323.225 37.2626C321.858 35.8463 320.863 34.1124 320.332 32.2169C319.8 30.3214 319.748 28.3236 320.18 26.4028C323.326 25.9252 326.538 26.6209 329.205 28.3575C329.857 28.7453 330.437 29.2433 330.918 29.8294Z"
                  fill="#137C41" />
                  //3
                 <circle cx="636" cy="32" r="32" fill="#137C41" fill-opacity="0"/>
                <path
                  d="M665.009 43.1256C664.839 43.1437 664.668 43.1009 664.526 43.0049C664.33 42.9467 664.147 42.8487 663.99 42.7171C663.833 42.5854 663.705 42.423 663.614 42.2397C663.522 42.0565 663.469 41.8563 663.458 41.6517C663.447 41.4471 663.478 41.2424 663.549 41.0503C665.245 35.957 665.48 30.4905 664.228 25.2703C662.977 20.0501 660.288 15.2848 656.466 11.5144C651.528 6.65986 645.027 3.71437 638.121 3.20182C631.214 2.68928 624.35 4.64291 618.749 8.71525C618.594 8.86746 618.408 8.98417 618.204 9.05731C617.999 9.13046 617.781 9.15828 617.565 9.13883C617.349 9.11938 617.14 9.05316 616.952 8.94472C616.764 8.83627 616.602 8.6882 616.476 8.51082C616.351 8.33344 616.266 8.13093 616.227 7.91742C616.188 7.70392 616.196 7.48452 616.251 7.27439C616.305 7.06426 616.404 6.86846 616.542 6.70058C616.68 6.5327 616.852 6.39676 617.047 6.30218C623.195 1.73167 630.782 -0.474878 638.423 0.0855579C646.063 0.645993 653.247 3.93605 658.662 9.35475C662.851 13.5576 665.789 18.842 667.149 24.6179C668.508 30.3939 668.235 36.4341 666.36 42.0639C666.3 42.3735 666.13 42.6511 665.882 42.846C665.634 43.0409 665.324 43.1401 665.009 43.1256Z"
                  fill="#137C41" />
                <path
                  d="M635.966 64.1192C635.232 64.1398 634.497 64.0995 633.77 63.9986C626.081 63.4459 618.846 60.1538 613.379 54.7204C607.887 49.3032 604.583 42.0527 604.1 34.3541C603.494 26.7323 605.662 19.148 610.205 12.9984C610.3 12.8031 610.436 12.6306 610.604 12.4931C610.772 12.3555 610.967 12.2562 611.177 12.2019C611.388 12.1476 611.607 12.1396 611.821 12.1786C612.034 12.2176 612.237 12.3025 612.414 12.4276C612.591 12.5527 612.739 12.7148 612.848 12.9028C612.956 13.0908 613.023 13.3002 613.042 13.5163C613.061 13.7325 613.034 13.9503 612.96 14.1546C612.887 14.359 612.771 14.5449 612.618 14.6996C608.462 20.2759 606.451 27.1618 606.954 34.0985C607.456 41.0353 610.439 47.5594 615.356 52.478C620.274 57.3966 626.797 60.3812 633.734 60.8859C640.671 61.3907 647.558 59.382 653.135 55.2271C653.293 55.0964 653.475 54.9996 653.671 54.9427C653.868 54.8858 654.074 54.8701 654.276 54.8966C654.479 54.923 654.674 54.9911 654.849 55.0964C655.025 55.2018 655.176 55.3423 655.294 55.509C655.413 55.6757 655.495 55.865 655.537 56.0651C655.579 56.2652 655.579 56.4718 655.537 56.6719C655.495 56.872 655.412 57.0613 655.294 57.2279C655.176 57.3945 655.024 57.5349 654.849 57.6401C649.464 61.866 642.81 64.1491 635.966 64.1192Z"
                  fill="#137C41" />
                <path
                  d="M635.968 47.8909C635.548 47.8817 635.148 47.7109 634.852 47.4142C634.555 47.1175 634.384 46.7179 634.375 46.2984V38.9747C634.41 38.5778 634.592 38.2083 634.886 37.9391C635.179 37.6699 635.563 37.5205 635.962 37.5205C636.36 37.5205 636.744 37.6699 637.038 37.9391C637.332 38.2083 637.514 38.5778 637.548 38.9747V46.2984C637.542 46.7168 637.374 47.1164 637.079 47.4134C636.784 47.7104 636.386 47.8816 635.968 47.8909Z"
                  fill="#3C3B3D" />
                <path
                  d="M660.853 50.4498C661.493 51.0893 661.928 51.904 662.105 52.791C662.281 53.678 662.191 54.5975 661.845 55.433C661.499 56.2686 660.912 56.9827 660.16 57.4852C659.408 57.9876 658.524 58.2558 657.62 58.2558C656.715 58.2558 655.831 57.9876 655.079 57.4852C654.327 56.9827 653.741 56.2686 653.395 55.433C653.049 54.5975 652.958 53.678 653.135 52.791C653.311 51.904 653.747 51.0893 654.386 50.4498C654.805 50.0148 655.307 49.6687 655.863 49.4323C656.418 49.196 657.016 49.0742 657.62 49.0742C658.224 49.0742 658.821 49.196 659.377 49.4323C659.932 49.6687 660.435 50.0148 660.853 50.4498Z"
                  fill="#A5C63B" />
                <path
                  d="M617.65 7.24378C618.29 7.8833 618.725 8.69802 618.902 9.58505C619.078 10.4721 618.988 11.3915 618.642 12.2271C618.295 13.0626 617.709 13.7768 616.957 14.2792C616.205 14.7817 615.321 15.0499 614.417 15.0499C613.512 15.0499 612.628 14.7817 611.876 14.2792C611.124 13.7768 610.538 13.0626 610.192 12.2271C609.846 11.3915 609.755 10.4721 609.932 9.58505C610.108 8.69802 610.544 7.8833 611.183 7.24378C611.602 6.80879 612.104 6.46271 612.66 6.22635C613.215 5.99 613.813 5.86816 614.417 5.86816C615.021 5.86816 615.618 5.99 616.174 6.22635C616.729 6.46271 617.232 6.80879 617.65 7.24378Z"
                  fill="#70993F" />
                <path
                  d="M639.743 29.8298C637.589 32.1099 636.407 35.1392 636.449 38.2756H636.208C636.249 35.1392 635.068 32.1099 632.914 29.8298C632.333 29.265 631.72 28.7332 631.08 28.2372C630.591 26.9081 630.342 25.5028 630.344 24.0867C630.399 22.02 630.936 19.9947 631.912 18.1723C632.888 16.3499 634.276 14.7807 635.966 13.5898C637.664 14.7724 639.057 16.34 640.032 18.1645C641.008 19.989 641.537 22.0184 641.577 24.0867C641.596 25.465 641.346 26.8339 640.841 28.1166L641.094 28.3579C640.6 28.9732 640.117 29.3351 639.743 29.8298Z"
                  fill="#137C41" />
                <path
                  d="M649.632 26.2827C650.064 28.2034 650.011 30.2013 649.48 32.0968C648.948 33.9923 647.954 35.726 646.587 37.1424C645.22 38.5587 643.522 39.6132 641.646 40.2111C639.77 40.8091 637.776 40.9317 635.841 40.5681C635.699 39.7708 635.614 38.9644 635.587 38.155C635.538 35.0172 636.721 31.9851 638.881 29.7093C639.302 29.2749 639.754 28.8717 640.233 28.5027C643.002 26.6671 646.335 25.8798 649.632 26.2827Z"
                  fill="#137C41" />
                <path
                  d="M632.918 29.8294C635.072 32.1095 636.254 35.1388 636.212 38.2752C636.196 39.0846 636.115 39.8915 635.971 40.6882C634.036 41.0519 632.041 40.9293 630.166 40.3314C628.29 39.7334 626.592 38.6789 625.225 37.2626C623.858 35.8463 622.863 34.1124 622.332 32.2169C621.8 30.3214 621.748 28.3236 622.18 26.4028C625.326 25.9252 628.538 26.6209 631.205 28.3575C631.857 28.7453 632.437 29.2433 632.918 29.8294Z"
                  fill="#137C41" />
                  //4
                <circle cx="936" cy="32" r="32" fill="#137C41" fill-opacity="0"/>
                <path
                  d="M965.009 43.1256C964.839 43.1437 964.668 43.1009 964.526 43.0049C964.33 42.9467 964.147 42.8487 963.99 42.7171C963.833 42.5854 963.705 42.423 963.614 42.2397C963.522 42.0565 963.469 41.8563 963.458 41.6517C963.447 41.4471 963.478 41.2424 963.549 41.0503C965.245 35.957 965.48 30.4905 964.228 25.2703C962.977 20.0501 960.288 15.2848 956.466 11.5144C951.528 6.65986 945.027 3.71437 938.121 3.20182C931.214 2.68928 924.35 4.64291 918.749 8.71525C918.594 8.86746 918.408 8.98417 918.204 9.05731C917.999 9.13046 917.781 9.15828 917.565 9.13883C917.349 9.11938 917.14 9.05316 916.952 8.94472C916.764 8.83627 916.602 8.6882 916.476 8.51082C916.351 8.33344 916.266 8.13093 916.227 7.91742C916.188 7.70392 916.196 7.48452 916.251 7.27439C916.305 7.06426 916.404 6.86846 916.542 6.70058C916.68 6.5327 916.852 6.39676 917.047 6.30218C923.195 1.73167 930.782 -0.474878 938.423 0.0855579C946.063 0.645993 953.247 3.93605 958.662 9.35475C962.851 13.5576 965.789 18.842 967.149 24.6179C968.508 30.3939 968.235 36.4341 966.36 42.0639C966.3 42.3735 966.13 42.6511 965.882 42.846C965.634 43.0409 965.324 43.1401 965.009 43.1256Z"
                  fill="#137C41" />
                <path
                  d="M935.966 64.1192C935.232 64.1398 934.497 64.0995 933.77 63.9986C926.081 63.4459 918.846 60.1538 913.379 54.7204C907.887 49.3032 904.583 42.0527 904.1 34.3541C903.494 26.7323 905.662 19.148 910.205 12.9984C910.3 12.8031 910.436 12.6306 910.604 12.4931C910.772 12.3555 910.967 12.2562 911.177 12.2019C911.388 12.1476 911.607 12.1396 911.821 12.1786C912.034 12.2176 912.237 12.3025 912.414 12.4276C912.591 12.5527 912.739 12.7148 912.848 12.9028C912.956 13.0908 913.023 13.3002 913.042 13.5163C913.061 13.7325 913.034 13.9503 912.96 14.1546C912.887 14.359 912.771 14.5449 912.618 14.6996C908.462 20.2759 906.451 27.1618 906.954 34.0985C907.456 41.0353 910.439 47.5594 915.356 52.478C920.274 57.3966 926.797 60.3812 933.734 60.8859C940.671 61.3907 947.558 59.382 953.135 55.2271C953.293 55.0964 953.475 54.9996 953.671 54.9427C953.868 54.8858 954.074 54.8701 954.276 54.8966C954.479 54.923 954.674 54.9911 954.849 55.0964C955.025 55.2018 955.176 55.3423 955.294 55.509C955.413 55.6757 955.495 55.865 955.537 56.0651C955.579 56.2652 955.579 56.4718 955.537 56.6719C955.495 56.872 955.412 57.0613 955.294 57.2279C955.176 57.3945 955.024 57.5349 954.849 57.6401C949.464 61.866 942.81 64.1491 935.966 64.1192Z"
                  fill="#137C41" />
                <path
                  d="M935.968 47.8909C935.548 47.8817 935.148 47.7109 934.852 47.4142C934.555 47.1175 934.384 46.7179 934.375 46.2984V38.9747C934.41 38.5778 934.592 38.2083 934.886 37.9391C935.179 37.6699 935.563 37.5205 935.962 37.5205C936.36 37.5205 936.744 37.6699 937.038 37.9391C937.332 38.2083 937.514 38.5778 937.548 38.9747V46.2984C937.542 46.7168 937.374 47.1164 937.079 47.4134C936.784 47.7104 936.386 47.8816 935.968 47.8909Z"
                  fill="#3C3B3D" />
                <path
                  d="M960.853 50.4498C961.493 51.0893 961.928 51.904 962.105 52.791C962.281 53.678 962.191 54.5975 961.845 55.433C961.499 56.2686 960.912 56.9827 960.16 57.4852C959.408 57.9876 958.524 58.2558 957.62 58.2558C956.715 58.2558 955.831 57.9876 955.079 57.4852C954.327 56.9827 953.741 56.2686 953.395 55.433C953.049 54.5975 952.958 53.678 953.135 52.791C953.311 51.904 953.747 51.0893 954.386 50.4498C954.805 50.0148 955.307 49.6687 955.863 49.4323C956.418 49.196 957.016 49.0742 957.62 49.0742C958.224 49.0742 958.821 49.196 959.377 49.4323C959.932 49.6687 960.435 50.0148 960.853 50.4498Z"
                  fill="#A5C63B" />
                <path
                  d="M917.65 7.24378C918.29 7.8833 918.725 8.69802 918.902 9.58505C919.078 10.4721 918.988 11.3915 918.642 12.2271C918.295 13.0626 917.709 13.7768 916.957 14.2792C916.205 14.7817 915.321 15.0499 914.417 15.0499C913.512 15.0499 912.628 14.7817 911.876 14.2792C911.124 13.7768 910.538 13.0626 910.192 12.2271C909.846 11.3915 909.755 10.4721 909.932 9.58505C910.108 8.69802 910.544 7.8833 911.183 7.24378C911.602 6.80879 912.104 6.46271 912.66 6.22635C913.215 5.99 913.813 5.86816 914.417 5.86816C915.021 5.86816 915.618 5.99 916.174 6.22635C916.729 6.46271 917.232 6.80879 917.65 7.24378Z"
                  fill="#70993F" />
                <path
                  d="M939.743 29.8298C937.589 32.1099 936.407 35.1392 936.449 38.2756H936.208C936.249 35.1392 935.068 32.1099 932.914 29.8298C932.333 29.265 931.72 28.7332 931.08 28.2372C930.591 26.9081 930.342 25.5028 930.344 24.0867C930.399 22.02 930.936 19.9947 931.912 18.1723C932.888 16.3499 934.276 14.7807 935.966 13.5898C937.664 14.7724 939.057 16.34 940.032 18.1645C941.008 19.989 941.537 22.0184 941.577 24.0867C941.596 25.465 941.346 26.8339 940.841 28.1166L941.094 28.3579C940.6 28.9732 940.117 29.3351 939.743 29.8298Z"
                  fill="#137C41" />
                <path
                  d="M949.632 26.2827C950.064 28.2034 950.011 30.2013 949.48 32.0968C948.948 33.9923 947.954 35.726 946.587 37.1424C945.22 38.5587 943.522 39.6132 941.646 40.2111C939.77 40.8091 937.776 40.9317 935.841 40.5681C935.699 39.7708 935.614 38.9644 935.587 38.155C935.538 35.0172 936.721 31.9851 938.881 29.7093C939.302 29.2749 939.754 28.8717 940.233 28.5027C943.002 26.6671 946.335 25.8798 949.632 26.2827Z"
                  fill="#137C41" />
                <path
                  d="M932.918 29.8294C935.072 32.1095 936.254 35.1388 936.212 38.2752C936.196 39.0846 936.115 39.8915 935.971 40.6882C934.036 41.0519 932.041 40.9293 930.166 40.3314C928.29 39.7334 926.592 38.6789 925.225 37.2626C923.858 35.8463 922.863 34.1124 922.332 32.2169C921.8 30.3214 921.748 28.3236 922.18 26.4028C925.326 25.9252 928.538 26.6209 931.205 28.3575C931.857 28.7453 932.437 29.2433 932.918 29.8294Z"
                  fill="#137C41" />
        <line
          x1="63.0063"
          y1="31.5"
          x2="302.006"
          y2="32.5"
          stroke="#137C41"
          stroke-width="3" />
        <line
          x1="365.006"
          y1="32.5"
          x2="604.006"
          y2="33.5"
          stroke="#137C41"
          stroke-width="3" />
        <line
          x1="668.006"
          y1="32.5"
          x2="907.006"
          y2="33.5"
          stroke="#137C41"
          stroke-width="3" />
      </svg>
            </div>
            <div class='flat-detail'>
            <div class="flat-text"><span>原始农业</span><span>传统农业</span><span>近代农业</span><span>现代农业</span></div>
          </div>
          
        
    `;
  }
}

class PlowDetailItem extends HTMLElement {
  constructor() {
    super();
    this.attachShadow({ mode: 'open' });
  }

  static get observedAttributes() {
    return ['title', 'poem', 'description', 'image'];
  }

  connectedCallback() {
    this.render();
  }

  attributeChangedCallback(name, oldValue, newValue) {
    if (oldValue !== newValue) {
      this.render();
    }
  }

  render() {
    const title = this.getAttribute('title') || '';
    const poem = this.getAttribute('poem') || '';
    const description = this.getAttribute('description') || '';
    const image = this.getAttribute('image') || '';

    this.shadowRoot.innerHTML = `
      <style>
        .plow-item {
          height: 100%;
          display: flex;
          justify-content: center;
          align-items: end;
        }

        .plow-item-left {
           position: relative;
         bottom:3rem;
          height: fit-content;
        }

        .plow-item-left p {
          font-family: 'fangfang', sans-serif;
          text-align: center;
          font-size: 1.8rem;
          line-height: 185%;
          letter-spacing: 3%;
          opacity: 0.7;
        }

        .plow-item-middle {
          margin: 0 10rem;
  
        }
        .plow-item-middle-title {
        margin: 1rem;
        }
        .plow-item-middle-title {
          font-family: 'fangfang', sans-serif;
          font-size: 2.5rem;
          line-height: 100%;
          letter-spacing: -1.1%;
          opacity: 1;
        }

        .plow-item-middle img {
        max-height: 54vh;
          // scale: 0.9;
          // transform: translateY(-4rem);
        }
        .plow-item-middle p {
          text-align: center;
        }
        .plow-item-right {
         position: relative;
         bottom:21rem;
          height: fit-content;
          max-width: 25rem;
        }

        .plow-item-right p {
          font-family: 'fangfang', sans-serif;
          text-align: center;
          font-size: 1.8rem;
          line-height: 185%;
          letter-spacing: 3%;
          opacity: 0.7;
        }
          .line-svg {
          position: absolute;
          width: 40%;
          height: 100%;
          left: 50%;
          transform: translateX(-54%);
        }
      </style>

      <div class="plow-item">
        <div class="plow-item-left">
          <p>《${title}》</p>
          ${poem
            .split('\n')
            .map((line) => `<p>${line}</p>`)
            .join('')}
        </div>
        <div class="plow-item-middle">
         <!-- 线条 -->
      <svg
        class="line-svg"
        width="811"
        height="552"
        viewBox="0 0 811 552"
        fill="none"
        xmlns="http://www.w3.org/2000/svg">
        <line
          y1="-2"
          x2="46.1351"
          y2="-2"
          transform="matrix(0.794768 -0.606914 0.321388 0.946948 720 32)"
          stroke="#137C41"
          stroke-width="4" />
        <line
          y1="-2"
          x2="46.1351"
          y2="-2"
          transform="matrix(0.794768 0.606914 0.321388 -0.946948 730 231)"
          stroke="#137C41"
          stroke-width="4" />
        <line
          y1="-2"
          x2="86.0646"
          y2="-2"
          transform="matrix(0.937281 -0.348575 0.163077 0.986613 720 62)"
          stroke="#137C41"
          stroke-width="4" />
        <line
          y1="-2"
          x2="86.0646"
          y2="-2"
          transform="matrix(0.937281 0.348575 0.163077 -0.986613 730 201)"
          stroke="#137C41"
          stroke-width="4" />
        <line
          y1="-2"
          x2="46.1351"
          y2="-2"
          transform="matrix(-0.794768 -0.606914 -0.321388 0.946948 86 153)"
          stroke="#137C41"
          stroke-width="4" />
        <line
          y1="-2"
          x2="46.1351"
          y2="-2"
          transform="matrix(-0.794768 0.606914 -0.321388 -0.946948 80.6641 520)"
          stroke="#137C41"
          stroke-width="4" />
        <line
          y1="-2"
          x2="86.0646"
          y2="-2"
          transform="matrix(-0.937281 -0.348575 -0.163077 0.986613 86 183)"
          stroke="#137C41"
          stroke-width="4" />
        <line
          y1="-2"
          x2="86.0646"
          y2="-2"
          transform="matrix(-0.937281 0.348575 -0.163077 -0.986613 80.6641 490)"
          stroke="#137C41"
          stroke-width="4" />
      </svg>
          <p class="plow-item-middle-title">《${title}》</p>
          <img src="${image}" alt="${title}" />
        </div>
        <div class="plow-item-right">
          <p class="plow-item-right-title">${description}</p>
        </div>
      </div>
    `;
  }
}

class RotatingBoxes extends HTMLElement {
  constructor() {
    super();
    this.attachShadow({ mode: 'open' });
    this.currentIndex = 0;
    this.isScrolling = false;
    this.throttleTimeout = 300; // 减少节流时间
    this.expanded = {
      profile: false,
      method: false,
    };

    // 颜色配置
    this.colors = {
      0: {
        group1: ['#FCC62D', '#E2B23B', '#FFD24D'],
        group2: ['#137C41', '#137C41', '#137C41'],
        group3: ['#137C41', '#137C41', '#137C41'],
        group4: ['#137C41', '#137C41', '#137C41'],
      },
      1: {
        group1: ['#137C41', '#137C41', '#137C41'],
        group2: ['#FCC62D', '#E2B23B', '#FFD24D'],
        group3: ['#137C41', '#137C41', '#137C41'],
        group4: ['#137C41', '#137C41', '#137C41'],
      },
      2: {
        group1: ['#137C41', '#137C41', '#137C41'],
        group2: ['#137C41', '#137C41', '#137C41'],
        group3: ['#FCC62D', '#E2B23B', '#FFD24D'],
        group4: ['#137C41', '#137C41', '#137C41'],
      },
      3: {
        group1: ['#137C41', '#137C41', '#137C41'],
        group2: ['#137C41', '#137C41', '#137C41'],
        group3: ['#137C41', '#137C41', '#137C41'],
        group4: ['#FCC62D', '#E2B23B', '#FFD24D'],
      },
    };

    // 内容配置
    this.contents = [
      {
        title: '原始农业',
        images: Array.from(
          { length: 8 },
          (_, i) => `../assets/imgs/origin/farm-tools/y${i + 1}.png`
        ),
        details: [
          {
            title: '石镰',
            time: ['新石器时代'],
            description:
              '在7000年以前，黄河流域已经普遍种植粟，石镰是收割粟的工具。使用时在镰身后部捆绑竖柄。为增加石镰的切割能力，还特意把石镰的刃部加工成细密的锯齿状。',
          },
          {
            title: '锄',
            time: ['新石器时代'],
            description:
              '锄是一种中耕除草工具，也是掘土整地工具。古代一般是将器身较宽平呈长方形的称为锄，使用时边挖土边向前进。适合人蹲在田间除草时使用。',
          },
          {
            title: '石斧',
            time: ['新石器时代'],
            description:
              '石斧是远古时代用于砍伐等多种用途的石质工具。斧体较厚重，一般呈梯形或近似长方形，两面刃，磨制而成。多斜刃或斜弧刃，亦有正弧刃或平刃。',
          },
          {
            title: '骨耜',
            time: ['新石器时代'],
            description:
              '骨耜（sì）是用偶蹄类动物的肩胛骨制成的。其上端厚而窄，是柄部；下端薄而宽，是刃部。柄部凿一横孔，刃部凿两竖孔。横孔插入一根横木，用藤条捆绑固定。骨耜比石器轻便灵巧，而且表面光滑，不容易沾泥，适宜在江南水田里使用。',
          },
          {
            title: '木质耒耜',
            time: ['新石器晚期', '青铜时代'],
            description:
              '木质耒耜用于农业生产中的翻整土地、播种庄稼。耒耜耒是耒耜的柄，耜是耒耜下端的起土部分。耒是一根尖头木棍加上一段短横梁。使用时把尖头插入土壤，然后用脚踩横梁使木棍深入，然后翻出。',
          },
          {
            title: '骨针',
            time: ['旧石器时代', '新石器时代'],
            description:
              '骨针是原始人的缝纫工具，用骨头制成。骨针表明山顶洞人的钻孔技术已相当熟练，制造钻孔工具的技术已达到相当水平。装饰品说明山顶洞人掌握了磨制技术。',
          },
          {
            title: '耙',
            time: ['新石器时代'],
            description:
              '耙（木耙、铁齿耙），用于碎土、平整土地，提高土壤保水性。',
          },
          {
            title: '铁制耒耜',
            time: ['春秋战国时期'],
            description:
              '铁制耒耜原始的翻土工具，用于松土和播种。汉代虽逐渐被铁犁取代，但在部分地区仍沿用。',
          },
        ],
      },
      {
        title: '传统农业',
        images: Array.from(
          { length: 8 },
          (_, i) => `../assets/imgs/origin/farm-tools/c${i + 1}.png`
        ),
        details: [
          {
            title: '犁',
            time: ['东汉', '明清'],
            description:
              '一种轻便的短曲辕犁，又称江东犁。它最早出现于唐代后期的江东地区，它的出现是古代中国耕作农具成熟的标志。犁普遍使用前，耒耜是主要耕作工具。',
          },
          {
            title: '铁锄',
            time: ['战国', '秦汉'],
            description:
              '铁锄是由石锄、青铜锄演变而来的。 铁锄也代替了原先的石锄。在耕地进行整休、播种、施肥等步骤后，就进入了另一道工序—— 中耕，中耕就是除草、松土，以保证庄稼的正常生长。',
          },
          {
            title: '石磨',
            time: ['汉代', '清末'],
            description:
              '石磨是用于把米、麦、豆等粮食加工成粉、浆的一种机械。开始用人力或畜力，到了晋代，中国劳动人民发明了用水做动力的水磨。通常由两个圆石做成。 磨是平面的两层，两层的接合处都有纹理，粮食从上方的孔进入两层中间，沿着纹理向外运移，在滚动过两层面时被磨碎，形成粉末。',
          },
          {
            title: '‌木叉',
            time: ['古代', '近代'],
            description:
              '‌木叉农具‌是一种在农业活动中广泛使用的工具，主要用于挑起、堆垛和整理农作物。',
          },
          {
            title: '打风车',
            time: ['宋代', '明清'],
            description:
              '打风车是明代从江南传入冀东的一种木制民用粮食加工设备，作用是利用风和比重、惯性等原理分离谷物的成、秕或米、糠。',
          },
          {
            title: '耙子',
            time: ['唐宋以后'],
            description:
              '耙子通过划过土地的方式，将土壤疏松，使得土壤中的氧气和水分更容易渗透到根系中，提高土壤通透性和透气性，有利于种子的生长发育。 其次，耙子还可以用来除草。耙子还可以用来平整土地。',
          },
          {
            title: '龙骨车',
            time: ['东汉起', '清代常见'],
            description:
              '龙骨车，即翻车，汉代中国劳动人民创造的一种机械提水工具，一种木制的水车，带水的木板用木榫连接或环带以戽水，多用人力或畜力转动。',
          },
          {
            title: '背篓',
            time: ['古代至今'],
            description:
              '背篓‌是一种使用竹条或藤、柳条等编织而成的背具，主要用于背在背上运输物品。它的形状通常为腰小口大，底部方圆形，口呈喇叭形，左右两侧各有与肩同宽的肩带。',
          },
        ],
      },
      {
        title: '近代农业',
        images: Array.from(
          { length: 8 },
          (_, i) => `../assets/imgs/origin/farm-tools/j${i + 1}.png`
        ),
        details: [
          {
            title: '手摇播种机',
            time: ['清末', '民国'],
            description:
              '手摇播种机是一种适用于小面积农田和家庭菜园的便携式播种工具。通过手摇驱动播种装置，可将种子均匀撒播至土壤中，具有操作简单、节省种子、便于携带等优点。',
          },
          {
            title: '‌铁质犁头',
            time: ['清中期', '民国'],
            description:
              '‌铁质犁头在近代的发展和应用‌主要体现在其材质的改进和设计的人性化。铁质犁头相较于传统的木犁头，具有更高的硬度和耐磨性，能够更好地破土翻耕，极大地提高了农业生产效率‌',
          },
          {
            title: '割草机',
            time: ['民国初期', '建国'],
            description:
              '割草机‌是一种用于修剪草坪、植被等的机械工具，也被称为除草机、剪草机或草坪修剪机。它主要由刀盘、发动机、行走轮、行走机构、刀片、扶手和控制部分组成‌。',
          },
          {
            title: '铁耙',
            time: ['清末', '民国'],
            description:
              '‌铁耙‌是一种传统的农业生产工具，主要用于翻松土壤和整平地面。铁耙由木把和钯头组成，钯头上装有铁齿，这些铁齿在翻地时能够深深插入泥土，帮助农民翻松土壤。‌',
          },
          {
            title: '足踏水车',
            time: ['清至民国'],
            description:
              '足踏水车‌，又称脚蹬水车或踏车，是我国古代一种重要的农业灌溉工具，其历史可以追溯到汉代，是农耕文明的产物之一。足踏水车通过人力踩踏脚踏板，驱动齿轮转动，进而带动刮板叶片将水从低处提升至高处，实现农田灌溉‌‌',
          },
          {
            title: '拉钻',
            time: ['20世纪初至今'],
            description:
              '拉钻由握把、钻把、拉杆和牵绳等组成，通过牵绳与钻杆之间产生的摩擦力，随着拉杆的往复拉动，而使钻杆作往复转动而起到钻孔的作用，能钻直径2-7毫米的孔。‌',
          },
          {
            title: '锄头',
            time: ['古代至今'],
            description:
              '锄头主要用于除草、松土和翻土等农活。锄刃用于松土和除草，通常呈扁长形，有长方形、狭长形、梯形等不同形状；柄则是一根圆形木棍，常用硬木制成，用于支撑锄刃‌。‌',
          },
          {
            title: '犁',
            time: ['明清后期至20世纪中叶'],
            description:
              '犁是一种耕地的农具，犁以翻土为主要功能，并有松土、碎土作用的土壤耕作机械。 主要有铧式犁、圆盘犁、旋转犁等类型‌',
          },
        ],
      },
      {
        title: '现代农业',
        images: Array.from(
          { length: 8 },
          (_, i) => `../assets/imgs/origin/farm-tools/x${i + 1}.png`
        ),
        details: [
          {
            title: '拖拉机',
            time: ['1950年代起普及'],
            description:
              '拖拉机是用于农业生产的一种机械设备，主要用于耕地、播种、收割等农业生产活动。',
          },
          {
            title: '联合收割机',
            time: ['1970年代起普及'],
            description:
              '联合收割机是一种农业机械，专门用于收割和处理农作物，尤其是谷物，如小麦、玉米和大米。 它结合了多个作业功能，包括割禾、脱粒、清理和装载，能够高效地完成传统上需要手工或多种机械设备的工作。‌',
          },
          {
            title: '插秧机',
            time: ['80年代推广'],
            description:
              '插秧机是将稻苗植入 稻田 中的一种 农业机械。 进行种植时，首先以机械爪从苗床中取出数株 稻苗 植入田中的泥土，为了保持对苗床与地面的角度为直角，机械爪的前端移动时必须采取 椭圆形 的动作曲线。‌',
          },
          {
            title: '土壤检测仪',
            time: ['21世纪'],
            description:
              '传统的土壤检测方法往往需要送样至实验室，耗时长且成本高。 而土壤检测仪可以现场检测，帮助农民快速做出决策，减少因盲目施肥或灌溉带来的损失。',
          },
          {
            title: '无人机',
            time: ['2010年后'],
            description:
              '无人机可以快速覆盖大片土地，完成播种、施肥、喷洒农药等任务。 与传统的人工或机械作业相比，无人机能够节省大量时间和劳力，提高作业效率。',
          },
          {
            title: '温室控制',
            time: ['2000年代起'],
            description:
              '温室控制通过监测温室内的环境参数，并根据作物的需求进行调整，以满足适宜作物生长的需求；温室模型则通过分析温室内作物小气候参数和作物生长数据，来预测作物的生长情况。',
          },
          {
            title: '智慧灌溉',
            time: ['2010年代推广'],
            description:
              '智慧灌溉技术是指利用物联网、大数据、云计算等现代信息技术，对农田灌溉过程进行智能化管理和控制，以实现节水、节能、增产、增效的目标。',
          },
          {
            title: '卫星遥感',
            time: ['21世纪初投入农业'],
            description:
              '卫星遥感技术可以通过观测和监测农田的植被覆盖情况和颜色变化，以识别出农作物的类型、病虫害根源及时发现，判断生态环境等因素，从而为农业生产提供实用数据。',
          },
        ],
      },
    ];

    // 节流函数
    this.throttle = (func, limit) => {
      let inThrottle;
      return function (...args) {
        if (!inThrottle) {
          func.apply(this, args);
          inThrottle = true;
          setTimeout(() => (inThrottle = false), limit);
        }
      };
    };

    // 防抖函数
    this.debounce = (func, wait) => {
      let timeout;
      return function executedFunction(...args) {
        const later = () => {
          clearTimeout(timeout);
          func(...args);
        };
        clearTimeout(timeout);
        timeout = setTimeout(later, wait);
      };
    };
  }

  connectedCallback() {
    this.render();
    this.setupEventListeners();
  }

  // 生成旋转盒子的HTML
  generateRotateBoxesHTML() {
    return this.contents[this.currentIndex].images
      .map(
        (src, index) => `
        <div class="rotate-box" data-index="${index}">
          <img src="${src}" alt="农业工具 ${index + 1}">
        </div>
      `
      )
      .join('');
  }

  // 生成中心内容的HTML
  generateCenterContentHTML() {
    const currentContent = this.contents[this.currentIndex];
    const details = currentContent.details?.[0] || {
      title: '农业工具',
      time: ['未知时期'],
      description: '暂无描述',
    };

    return `
      <div class="title">
        <img src="${currentContent.images[0]}" alt="farm-tools">
        <p>${details.title}</p>
      </div>
      <div class="time">
        ${details.time.map((t) => `<p>${t}</p>`).join('')}
      </div>
      <div class="description">
        <p>${details.description}</p>
      </div>
     <img src="../assets/imgs/origin/farm-tools/farmtool-bg.svg" alt="farm-tools">
    `;
  }

  // 更新工具详情
  updateToolDetails(index) {
    const currentContent = this.contents[this.currentIndex];
    if (currentContent.details?.[index]) {
      const details = currentContent.details[index];
      const rotateContent = this.shadowRoot.querySelector('.rotate-content');
      const titleDiv = rotateContent.querySelector('.title');
      const timeDiv = rotateContent.querySelector('.time');
      const descriptionDiv = rotateContent.querySelector('.description');

      if (titleDiv) {
        titleDiv.innerHTML = `
          <img src="${currentContent.images[index]}" alt="farm-tools">
          <p>${details.title}</p>
        `;
      }

      if (timeDiv) {
        timeDiv.innerHTML = details.time.map((t) => `<p>${t}</p>`).join('');
      }

      if (descriptionDiv) {
        descriptionDiv.innerHTML = `<p>${details.description}</p>`;
      }
    }
  }

  render() {
    this.shadowRoot.innerHTML = `
      <style>
        .scroll-container {
          height: 100%;
          display: flex;
          justify-content: center;
          align-items: center;
          width: 12%;
          position: relative;
          z-index: 10;
        }

        .scroll-text {
          height: 44.5rem;
          width: 100%;
          display: flex;
          flex-direction: column;
          justify-content: space-between;
          font-family: 'PingFang-SC-Semibold';
          font-weight: 600;
          font-size: 1.8rem;
          line-height: 118%;
          letter-spacing: -1.1%;
          position: relative;
          top: -2px;
          left: 0.6rem;
          text-align: right;
          margin-right: 1rem;
        }

        .scroll-text > p {
          cursor: pointer;
          transition: color 0.3s ease;
        }

        .scroll-text > p:hover {
          color: #137C41;
        }

        .scroll-text > p.active {
          color: #137C41;
        }

        .scroll-text > p:nth-child(3) {
          position: relative;
          top: 0.4rem;
        }

        .scroll-text > p:nth-child(4) {
          position: relative;
          top: 0.5rem;
        }
        .rotate-container {
         width: 87%;
          position: absolute;
          top: 50%;
           left: 50%;
        transform: translate(-43.5%, -50%);
          aspect-ratio: 1/1;
          border-radius: 50%;
        }

        .rotate-box {
          position: absolute;
          width: 20rem;
          height: 20rem;
          border-radius: 50%;
          left: 50%;
          top: 50%;
           margin-left: -10rem;
           margin-top: -10rem;
          opacity: 0.8;
          background: radial-gradient(
            50% 50% at 50% 50%,
            #fffcef 0%,
            #f0e3c0 80.77%,
            #e9d5ac 100%
          );
          box-shadow: 0px 0px 30.7px 0px #d4be81;
          transition: all 0.6s ease;
          cursor: pointer;
          transform-origin: center;
        }

        .rotate-box:hover {
          width: 24rem;
          height: 24rem;
          z-index: 1;
        }

        .rotate-box.active {
          width: 24rem;
          height: 24rem;
          z-index: 1;
        }

        .rotate-box img {
          width: 100%;
          height: 100%;
          object-fit: contain;
          border-radius: 50%;
          cursor: pointer;
          scale: 0.8;
        }
        circle{
        cursor: pointer;
        }
        .rotate-content {
          width: 475px;
          length: 475px;
          position: relative;
          top: 50%;
          left: 50%;
          transform: translate(-50%, -50%);
        }
        .rotate-content>img{
        position: absolute;
        left: 50%;
        top: 50%;
        transform: translate(-50%, -50%);
        width: 100%;
        z-index: 1;
        }
        .title {
          display: flex;
          flex-direction: column;
          justify-content: center;
          align-items: center;
          gap: 1rem;
          position:relative;
          z-index: 10;
        }

        .title>img {
       height: 7rem;

        }

        .title p {
          font-family: 'fangfang';
          font-size: 3rem;
          line-height: 141%;
          letter-spacing: -1.1%;
          width: fit-content;
          margin: 0;
        }

        .time {
          display: flex;
          justify-content: center;
          align-items: center;
          gap: 1rem;
          position:relative;
          z-index: 10;
        }

        .time p {
          border-radius: 22px;
          background: #137C41;
          color: #F9F1D4;
          font-family: STZhongsong;
          font-size: 1.5rem;
          line-height: 123%;
          letter-spacing: -1.1%;
          width: fit-content;
          padding: 0.5rem;
        }
        .description{
            display:flex;
            flex-direction: column;
            justify-content: center;
            align-items: center;
           font-family: PingFang-SC-Regular;
           font-size: 1.5rem;
           line-height: 150%;
          letter-spacing: -1.1%;
           color: #462204;
           position:relative;
          z-index: 10;
        }
        .description>p{
          text-align: center;
          margin: 0 4.5rem;
        }

        /* 添加圆形过渡动画样式 */
        circle {
          transition: fill-opacity 0.2s ease-in-out;
        }

        .rotate-box:nth-child(1) { animation: rotate1 60s linear infinite; }
        .rotate-box:nth-child(2) { animation: rotate2 60s linear infinite; }
        .rotate-box:nth-child(3) { animation: rotate3 60s linear infinite; }
        .rotate-box:nth-child(4) { animation: rotate4 60s linear infinite; }
        .rotate-box:nth-child(5) { animation: rotate5 60s linear infinite; }
        .rotate-box:nth-child(6) { animation: rotate6 60s linear infinite; }
        .rotate-box:nth-child(7) { animation: rotate7 60s linear infinite; }
        .rotate-box:nth-child(8) { animation: rotate8 60s linear infinite; }

        @keyframes rotate1 { from { transform: rotate(0deg) translate(400px) rotate(0deg); } to { transform: rotate(360deg) translate(400px) rotate(-360deg); } }
        @keyframes rotate2 { from { transform: rotate(45deg) translate(400px) rotate(-45deg); } to { transform: rotate(405deg) translate(400px) rotate(-405deg); } }
        @keyframes rotate3 { from { transform: rotate(90deg) translate(400px) rotate(-90deg); } to { transform: rotate(450deg) translate(400px) rotate(-450deg); } }
        @keyframes rotate4 { from { transform: rotate(135deg) translate(400px) rotate(-135deg); } to { transform: rotate(495deg) translate(400px) rotate(-495deg); } }
        @keyframes rotate5 { from { transform: rotate(180deg) translate(400px) rotate(-180deg); } to { transform: rotate(540deg) translate(400px) rotate(-540deg); } }
        @keyframes rotate6 { from { transform: rotate(225deg) translate(400px) rotate(-225deg); } to { transform: rotate(585deg) translate(400px) rotate(-585deg); } }
        @keyframes rotate7 { from { transform: rotate(270deg) translate(400px) rotate(-270deg); } to { transform: rotate(630deg) translate(400px) rotate(-630deg); } }
        @keyframes rotate8 { from { transform: rotate(315deg) translate(400px) rotate(-315deg); } to { transform: rotate(675deg) translate(400px) rotate(-675deg); } }
      </style>
      <div class="scroll-container">
        <div class="scroll-text">
          ${this.contents
            .map(
              (content, index) => `
            <p data-index="${index}" class="${
                index === this.currentIndex ? 'active' : ''
              }">${content.title}</p>
          `
            )
            .join('')}
        </div>
         <svg
        width="64"
        height="743"
        viewBox="0 0 64 743"
        fill="none"
        xmlns="http://www.w3.org/2000/svg">
        <line
          x1="32.5"
          y1="225"
          x2="32.5"
          y2="61"
          stroke="#137C41"
          stroke-width="3" />
        <line
          x1="31.5"
          y1="453"
          x2="31.5"
          y2="289"
          stroke="#137C41"
          stroke-width="3" />
        <line
          x1="31.5"
          y1="680"
          x2="31.5"
          y2="516"
          stroke="#137C41"
          stroke-width="3" />
        <circle cx="32" cy="32" r="32" fill="#137C41" />
                <path
          d="M61.0089 43.1256C60.8388 43.1437 60.6679 43.1009 60.5263 43.0049C60.3299 42.9467 60.1475 42.8487 59.9905 42.7171C59.8335 42.5854 59.7052 42.423 59.6135 42.2397C59.5219 42.0565 59.4689 41.8563 59.4578 41.6517C59.4467 41.4471 59.4777 41.2424 59.549 41.0503C61.2448 35.957 61.4801 30.4905 60.2283 25.2703C58.9765 20.0501 56.2877 15.2848 52.4663 11.5144C47.5275 6.65986 41.0269 3.71437 34.1205 3.20182C27.2142 2.68928 20.3499 4.64291 14.7486 8.71525C14.5939 8.86746 14.4079 8.98417 14.2035 9.05731C13.9992 9.13046 13.7814 9.15828 13.5652 9.13883C13.3491 9.11938 13.1397 9.05316 12.9517 8.94472C12.7637 8.83627 12.6015 8.6882 12.4765 8.51082C12.3514 8.33344 12.2664 8.13093 12.2275 7.91742C12.1885 7.70392 12.1964 7.48452 12.2507 7.27439C12.305 7.06426 12.4044 6.86846 12.542 6.70058C12.6795 6.5327 12.8519 6.39676 13.0473 6.30218C19.1953 1.73167 26.7824 -0.474878 34.4228 0.0855579C42.0632 0.645993 49.2471 3.93605 54.6623 9.35475C58.8512 13.5576 61.7894 18.842 63.1487 24.6179C64.5081 30.3939 64.2351 36.4341 62.3603 42.0639C62.2998 42.3735 62.1301 42.6511 61.882 42.846C61.634 43.0409 61.3241 43.1401 61.0089 43.1256Z"
                  fill="#137C41" />
                <path
          d="M31.9657 64.1192C31.2316 64.1398 30.4971 64.0995 29.7698 63.9986C22.0813 63.4459 14.8461 60.1538 9.37853 54.7204C3.88674 49.3032 0.583481 42.0527 0.0999172 34.3541C-0.506457 26.7323 1.66177 19.148 6.20522 12.9984C6.2998 12.8031 6.43574 12.6306 6.60363 12.4931C6.77152 12.3555 6.96733 12.2562 7.17746 12.2019C7.3876 12.1476 7.60705 12.1396 7.82056 12.1786C8.03407 12.2176 8.23652 12.3025 8.41391 12.4276C8.5913 12.5527 8.73937 12.7148 8.84782 12.9028C8.95627 13.0908 9.02253 13.3002 9.04198 13.5163C9.06143 13.7325 9.0336 13.9503 8.96046 14.1546C8.88731 14.359 8.7706 14.5449 8.61838 14.6996C4.46164 20.2759 2.45081 27.1618 2.95354 34.0985C3.45628 41.0353 6.439 47.5594 11.3563 52.478C16.2737 57.3966 22.7971 60.3812 29.734 60.8859C36.6709 61.3907 43.5577 59.382 49.1354 55.2271C49.2926 55.0964 49.475 54.9996 49.6714 54.9427C49.8677 54.8858 50.0738 54.8701 50.2765 54.8966C50.4792 54.923 50.6742 54.9911 50.8494 55.0964C51.0246 55.2018 51.1761 55.3423 51.2945 55.509C51.4128 55.6757 51.4954 55.865 51.5372 56.0651C51.5789 56.2652 51.5789 56.4718 51.537 56.6719C51.4952 56.872 51.4124 57.0613 51.294 57.2279C51.1755 57.3945 51.024 57.5349 50.8487 57.6401C45.4644 61.866 38.8103 64.1491 31.9657 64.1192Z"
                  fill="#137C41" />
                <path
          d="M31.9677 47.8909C31.5481 47.8817 31.1484 47.7109 30.8517 47.4142C30.555 47.1175 30.3842 46.7179 30.375 46.2984V38.9747C30.4096 38.5778 30.5918 38.2083 30.8855 37.9391C31.1793 37.6699 31.5632 37.5205 31.9617 37.5205C32.3601 37.5205 32.7441 37.6699 33.0378 37.9391C33.3315 38.2083 33.5137 38.5778 33.5483 38.9747V46.2984C33.5422 46.7168 33.374 47.1164 33.0792 47.4134C32.7845 47.7104 32.386 47.8816 31.9677 47.8909Z"
                  fill="#3C3B3D" />
                <path
          d="M56.8535 50.4498C57.493 51.0893 57.9285 51.904 58.1049 52.791C58.2814 53.678 58.1908 54.5975 57.8447 55.433C57.4985 56.2686 56.9124 56.9827 56.1604 57.4852C55.4084 57.9876 54.5243 58.2558 53.6198 58.2558C52.7154 58.2558 51.8313 57.9876 51.0793 57.4852C50.3272 56.9827 49.7411 56.2686 49.395 55.433C49.0489 54.5975 48.9583 53.678 49.1347 52.791C49.3112 51.904 49.7467 51.0893 50.3862 50.4498C50.805 50.0148 51.3072 49.6687 51.8628 49.4323C52.4184 49.196 53.016 49.0742 53.6198 49.0742C54.2236 49.0742 54.8212 49.196 55.3769 49.4323C55.9325 49.6687 56.4347 50.0148 56.8535 50.4498Z"
                  fill="#A5C63B" />
                <path
          d="M13.6503 7.24378C14.2898 7.8833 14.7254 8.69802 14.9018 9.58505C15.0782 10.4721 14.9877 11.3915 14.6415 12.2271C14.2954 13.0626 13.7093 13.7768 12.9573 14.2792C12.2053 14.7817 11.3211 15.0499 10.4167 15.0499C9.51227 15.0499 8.62815 14.7817 7.87614 14.2792C7.12412 13.7768 6.53798 13.0626 6.19186 12.2271C5.84574 11.3915 5.75518 10.4721 5.93161 9.58505C6.10804 8.69802 6.54356 7.8833 7.18307 7.24378C7.60183 6.80879 8.10405 6.46271 8.65967 6.22635C9.21529 5.99 9.81289 5.86816 10.4167 5.86816C11.0205 5.86816 11.6181 5.99 12.1737 6.22635C12.7294 6.46271 13.2316 6.80879 13.6503 7.24378Z"
                  fill="#70993F" />
                <path
          d="M35.743 29.8298C33.5889 32.1099 32.4074 35.1392 32.4491 38.2756H32.2077C32.2494 35.1392 31.0679 32.1099 28.9137 29.8298C28.3328 29.265 27.7205 28.7332 27.0798 28.2372C26.591 26.9081 26.3419 25.5028 26.3438 24.0867C26.3986 22.02 26.9355 19.9947 27.9117 18.1723C28.8879 16.3499 30.2764 14.7807 31.9664 13.5898C33.6639 14.7724 35.0572 16.34 36.0324 18.1645C37.0076 19.989 37.5369 22.0184 37.577 24.0867C37.5959 25.465 37.3459 26.8339 36.841 28.1166L37.0944 28.3579C36.5997 28.9732 36.117 29.3351 35.743 29.8298Z"
          fill="#FCC62D" />
        <path
          d="M45.632 26.2827C46.0637 28.2034 46.0114 30.2013 45.4799 32.0968C44.9484 33.9923 43.9543 35.726 42.5869 37.1424C41.2196 38.5587 39.5219 39.6132 37.6462 40.2111C35.7705 40.8091 33.7756 40.9317 31.8408 40.5681C31.6986 39.7708 31.6139 38.9644 31.5874 38.155C31.5381 35.0172 32.7207 31.9851 34.8814 29.7093C35.3021 29.2749 35.7537 28.8717 36.2328 28.5027C39.0015 26.6671 42.3345 25.8798 45.632 26.2827Z"
          fill="#E2B23B" />
        <path
          d="M28.9183 29.8294C31.0725 32.1095 32.2539 35.1388 32.2123 38.2752C32.1959 39.0846 32.1152 39.8915 31.971 40.6882C30.0362 41.0519 28.0414 40.9293 26.1657 40.3314C24.29 39.7334 22.5922 38.6789 21.2249 37.2626C19.8575 35.8463 18.8635 34.1124 18.332 32.2169C17.8005 30.3214 17.7482 28.3236 18.1798 26.4028C21.3261 25.9252 24.5383 26.6209 27.205 28.3575C27.857 28.7453 28.4368 29.2433 28.9183 29.8294Z"
          fill="#FFD24D" />
        <circle cx="32" cy="257" r="32" fill="#137C41" fill-opacity="0" />
        <path
          d="M61.0089 268.126C60.8388 268.144 60.6679 268.101 60.5263 268.005C60.3299 267.947 60.1475 267.849 59.9905 267.717C59.8335 267.585 59.7052 267.423 59.6135 267.24C59.5219 267.056 59.4689 266.856 59.4578 266.652C59.4467 266.447 59.4777 266.242 59.549 266.05C61.2448 260.957 61.4801 255.491 60.2283 250.27C58.9765 245.05 56.2877 240.285 52.4663 236.514C47.5275 231.66 41.0269 228.714 34.1205 228.202C27.2142 227.689 20.3499 229.643 14.7486 233.715C14.5939 233.867 14.4079 233.984 14.2035 234.057C13.9992 234.13 13.7814 234.158 13.5652 234.139C13.3491 234.119 13.1397 234.053 12.9517 233.945C12.7637 233.836 12.6015 233.688 12.4765 233.511C12.3514 233.333 12.2664 233.131 12.2275 232.917C12.1885 232.704 12.1964 232.485 12.2507 232.274C12.305 232.064 12.4044 231.868 12.542 231.701C12.6795 231.533 12.8519 231.397 13.0473 231.302C19.1953 226.732 26.7824 224.525 34.4228 225.086C42.0632 225.646 49.2471 228.936 54.6623 234.355C58.8512 238.558 61.7894 243.842 63.1487 249.618C64.5081 255.394 64.2351 261.434 62.3603 267.064C62.2998 267.373 62.1301 267.651 61.882 267.846C61.634 268.041 61.3241 268.14 61.0089 268.126Z"
                  fill="#137C41" />
                <path
          d="M31.9657 289.119C31.2316 289.14 30.4971 289.099 29.7698 288.999C22.0813 288.446 14.8461 285.154 9.37853 279.72C3.88674 274.303 0.583481 267.053 0.0999172 259.354C-0.506457 251.732 1.66177 244.148 6.20522 237.998C6.2998 237.803 6.43574 237.631 6.60363 237.493C6.77152 237.356 6.96733 237.256 7.17746 237.202C7.3876 237.148 7.60705 237.14 7.82056 237.179C8.03407 237.218 8.23652 237.303 8.41391 237.428C8.5913 237.553 8.73937 237.715 8.84782 237.903C8.95627 238.091 9.02253 238.3 9.04198 238.516C9.06143 238.732 9.0336 238.95 8.96046 239.155C8.88731 239.359 8.7706 239.545 8.61838 239.7C4.46164 245.276 2.45081 252.162 2.95354 259.099C3.45628 266.035 6.439 272.559 11.3563 277.478C16.2737 282.397 22.7971 285.381 29.734 285.886C36.6709 286.391 43.5577 284.382 49.1354 280.227C49.2926 280.096 49.475 280 49.6714 279.943C49.8677 279.886 50.0738 279.87 50.2765 279.897C50.4792 279.923 50.6742 279.991 50.8494 280.096C51.0246 280.202 51.1761 280.342 51.2945 280.509C51.4128 280.676 51.4954 280.865 51.5372 281.065C51.5789 281.265 51.5789 281.472 51.537 281.672C51.4952 281.872 51.4124 282.061 51.294 282.228C51.1755 282.395 51.024 282.535 50.8487 282.64C45.4644 286.866 38.8103 289.149 31.9657 289.119Z"
                  fill="#137C41" />
                <path
          d="M31.9677 272.891C31.5481 272.882 31.1484 272.711 30.8517 272.414C30.555 272.118 30.3842 271.718 30.375 271.298V263.975C30.4096 263.578 30.5918 263.208 30.8855 262.939C31.1793 262.67 31.5632 262.521 31.9617 262.521C32.3601 262.521 32.7441 262.67 33.0378 262.939C33.3315 263.208 33.5137 263.578 33.5483 263.975V271.298C33.5422 271.717 33.374 272.116 33.0792 272.413C32.7845 272.71 32.386 272.882 31.9677 272.891Z"
          fill="#3C3B3D" />
        <path
          d="M56.8535 275.45C57.493 276.089 57.9285 276.904 58.1049 277.791C58.2814 278.678 58.1908 279.597 57.8447 280.433C57.4985 281.269 56.9124 281.983 56.1604 282.485C55.4084 282.988 54.5243 283.256 53.6198 283.256C52.7154 283.256 51.8313 282.988 51.0793 282.485C50.3272 281.983 49.7411 281.269 49.395 280.433C49.0489 279.597 48.9583 278.678 49.1347 277.791C49.3112 276.904 49.7467 276.089 50.3862 275.45C50.805 275.015 51.3072 274.669 51.8628 274.432C52.4184 274.196 53.016 274.074 53.6198 274.074C54.2236 274.074 54.8212 274.196 55.3769 274.432C55.9325 274.669 56.4347 275.015 56.8535 275.45Z"
          fill="#A5C63B" />
        <path
          d="M13.6503 232.244C14.2898 232.883 14.7254 233.698 14.9018 234.585C15.0782 235.472 14.9877 236.392 14.6415 237.227C14.2954 238.063 13.7093 238.777 12.9573 239.279C12.2053 239.782 11.3211 240.05 10.4167 240.05C9.51227 240.05 8.62815 239.782 7.87614 239.279C7.12412 238.777 6.53798 238.063 6.19186 237.227C5.84574 236.392 5.75518 235.472 5.93161 234.585C6.10804 233.698 6.54356 232.883 7.18307 232.244C7.60183 231.809 8.10405 231.463 8.65967 231.226C9.21529 230.99 9.81289 230.868 10.4167 230.868C11.0205 230.868 11.6181 230.99 12.1737 231.226C12.7294 231.463 13.2316 231.809 13.6503 232.244Z"
          fill="#70993F" />
        <path
          d="M35.743 254.83C33.5889 257.11 32.4074 260.139 32.4491 263.276H32.2077C32.2494 260.139 31.0679 257.11 28.9137 254.83C28.3328 254.265 27.7205 253.733 27.0798 253.237C26.591 251.908 26.3419 250.503 26.3438 249.087C26.3986 247.02 26.9355 244.995 27.9117 243.172C28.8879 241.35 30.2764 239.781 31.9664 238.59C33.6639 239.772 35.0572 241.34 36.0324 243.164C37.0076 244.989 37.5369 247.018 37.577 249.087C37.5959 250.465 37.3459 251.834 36.841 253.117L37.0944 253.358C36.5997 253.973 36.117 254.335 35.743 254.83Z"
                  fill="#137C41" />
                <path
          d="M45.632 251.283C46.0637 253.203 46.0114 255.201 45.4799 257.097C44.9484 258.992 43.9543 260.726 42.5869 262.142C41.2196 263.559 39.5219 264.613 37.6462 265.211C35.7705 265.809 33.7756 265.932 31.8408 265.568C31.6986 264.771 31.6139 263.964 31.5874 263.155C31.5381 260.017 32.7207 256.985 34.8814 254.709C35.3021 254.275 35.7537 253.872 36.2328 253.503C39.0015 251.667 42.3345 250.88 45.632 251.283Z"
                  fill="#137C41" />
                <path
          d="M28.9183 254.829C31.0725 257.109 32.2539 260.139 32.2123 263.275C32.1959 264.085 32.1152 264.892 31.971 265.688C30.0362 266.052 28.0414 265.929 26.1657 265.331C24.29 264.733 22.5922 263.679 21.2249 262.263C19.8575 260.846 18.8635 259.112 18.332 257.217C17.8005 255.321 17.7482 253.324 18.1798 251.403C21.3261 250.925 24.5383 251.621 27.205 253.357C27.857 253.745 28.4368 254.243 28.9183 254.829Z"
                  fill="#137C41" />
        <circle cx="32" cy="485" r="32" fill="#137C41" fill-opacity="0" />
                <path
          d="M61.0089 496.126C60.8388 496.144 60.6679 496.101 60.5263 496.005C60.3299 495.947 60.1475 495.849 59.9905 495.717C59.8335 495.585 59.7052 495.423 59.6135 495.24C59.5219 495.056 59.4689 494.856 59.4578 494.652C59.4467 494.447 59.4777 494.242 59.549 494.05C61.2448 488.957 61.4801 483.491 60.2283 478.27C58.9765 473.05 56.2877 468.285 52.4663 464.514C47.5275 459.66 41.0269 456.714 34.1205 456.202C27.2142 455.689 20.3499 457.643 14.7486 461.715C14.5939 461.867 14.4079 461.984 14.2035 462.057C13.9992 462.13 13.7814 462.158 13.5652 462.139C13.3491 462.119 13.1397 462.053 12.9517 462.045C12.7637 461.936 12.6015 461.827 12.4765 461.718C12.3514 461.609 12.2664 461.5 12.2275 461.391C12.1885 461.282 12.1964 461.173 12.2507 461.064C12.305 460.955 12.4044 460.846 12.542 460.737C12.6795 460.628 12.8519 460.519 13.0473 460.41C19.1953 455.84 26.7824 453.633 34.4228 454.194C42.0632 454.755 49.2471 458.045 54.6623 463.464C58.8512 467.667 61.7894 472.951 63.1487 478.727C64.5081 484.503 64.2351 490.543 62.3603 496.173C62.2998 496.482 62.1301 496.76 61.882 496.955C61.634 497.15 61.3241 497.25 61.0089 497.236Z"
          fill="#137C41" />
        <path
          d="M31.9657 517.119C31.2316 517.14 30.4971 517.099 29.7698 516.999C22.0813 516.446 14.8461 513.154 9.37853 507.72C3.88674 502.303 0.583481 495.053 0.0999172 487.354C-0.506457 479.732 1.66177 472.148 6.20522 465.998C6.2998 465.803 6.43574 465.631 6.60363 465.493C6.77152 465.356 6.96733 465.256 7.17746 465.202C7.3876 465.148 7.60705 465.14 7.82056 465.179C8.03407 465.218 8.23652 465.303 8.41391 465.428C8.5913 465.553 8.73937 465.715 8.84782 465.903C8.95627 466.091 9.02253 466.3 9.04198 466.516C9.06143 466.732 9.0336 466.95 8.96046 467.155C8.88731 467.359 8.7706 467.545 8.61838 467.7C4.46164 473.276 2.45081 480.162 2.95354 487.099C3.45628 494.035 6.439 500.559 11.3563 505.478C16.2737 510.397 22.7971 513.381 29.734 513.886C36.6709 514.391 43.5577 512.382 49.1354 508.227C49.2926 508.096 49.475 508 49.6714 507.943C49.8677 507.886 50.0738 507.87 50.2765 507.897C50.4792 507.923 50.6742 507.991 50.8494 508.096C51.0246 508.202 51.1761 508.342 51.2945 508.509C51.4128 508.676 51.4954 508.865 51.5372 509.065C51.5789 509.265 51.5789 509.472 51.537 509.672C51.4952 509.872 51.4124 510.061 51.294 510.228C51.1755 510.395 51.024 510.535 50.8487 510.64C45.4644 514.866 38.8103 517.149 31.9657 517.119Z"
          fill="#137C41" />
        <path
          d="M31.9677 500.891C31.5481 500.882 31.1484 500.711 30.8517 500.414C30.555 500.118 30.3842 499.718 30.375 499.298V491.975C30.4096 491.578 30.5918 491.208 30.8855 490.939C31.1793 490.67 31.5632 490.521 31.9617 490.521C32.3601 490.521 32.7441 490.67 33.0378 490.939C33.3315 491.208 33.5137 491.578 33.5483 491.975V499.298C33.5422 499.717 33.374 500.116 33.0792 500.413C32.7845 500.71 32.386 500.882 31.9677 500.891Z"
                  fill="#3C3B3D" />
                <path
          d="M56.8535 503.45C57.493 504.089 57.9285 504.904 58.1049 505.791C58.2814 506.678 58.1908 507.597 57.8447 508.433C57.4985 509.269 56.9124 509.983 56.1604 510.485C55.4084 510.988 54.5243 511.256 53.6198 511.256C52.7154 511.256 51.8313 510.988 51.0793 510.485C50.3272 509.983 49.7411 509.269 49.395 508.433C49.0489 507.597 48.9583 506.678 49.1347 505.791C49.3112 504.904 49.7467 504.089 50.3862 503.45C50.805 503.015 51.3072 502.669 51.8628 502.432C52.4184 502.196 53.016 502.074 53.6198 502.074C54.2236 502.074 54.8212 502.196 55.3769 502.432C55.9325 502.669 56.4347 503.015 56.8535 503.45Z"
                  fill="#A5C63B" />
                <path
          d="M13.6503 460.244C14.2898 460.883 14.7254 461.698 14.9018 462.585C15.0782 463.472 14.9877 464.392 14.6415 465.227C14.2954 466.063 13.7093 466.777 12.9573 467.279C12.2053 467.782 11.3211 468.05 10.4167 468.05C9.51227 468.05 8.62815 467.782 7.87614 467.279C7.12412 466.777 6.53798 466.063 6.19186 465.227C5.84574 464.392 5.75518 463.472 5.93161 462.585C6.10804 461.698 6.54356 460.883 7.18307 460.244C7.60183 459.809 8.10405 459.463 8.65967 459.226C9.21529 458.99 9.81289 458.868 10.4167 458.868C11.0205 458.868 11.6181 458.99 12.1737 459.226C12.7294 459.463 13.2316 459.809 13.6503 460.244Z"
                  fill="#70993F" />
                <path
          d="M35.743 482.83C33.5889 485.11 32.4074 488.139 32.4491 491.276H32.2077C32.2494 488.139 31.0679 485.11 28.9137 482.83C28.3328 482.265 27.7205 481.733 27.0798 481.237C26.591 479.908 26.3419 478.503 26.3438 477.087C26.3986 475.02 26.9355 472.995 27.9117 471.172C28.8879 469.35 30.2764 467.781 31.9664 466.59C33.6639 467.772 35.0572 469.34 36.0324 471.164C37.0076 472.989 37.5369 475.018 37.577 477.087C37.5959 478.465 37.3459 479.834 36.841 481.117L37.0944 481.358C36.5997 481.973 36.117 482.335 35.743 482.83Z"
                  fill="#137C41" />
                <path
          d="M45.632 479.283C46.0637 481.203 46.0114 483.201 45.4799 485.097C44.9484 486.992 43.9543 488.726 42.5869 490.142C41.2196 491.559 39.5219 492.613 37.6462 493.211C35.7705 493.809 33.7756 493.932 31.8408 493.568C31.6986 492.771 31.6139 491.964 31.5874 491.155C31.5381 488.017 32.7207 484.985 34.8814 482.709C35.3021 482.275 35.7537 481.872 36.2328 481.503C39.0015 479.667 42.3345 478.88 45.632 479.283Z"
                  fill="#137C41" />
                <path
          d="M28.9183 482.829C31.0725 485.109 32.2539 488.139 32.2123 491.275C32.1959 492.085 32.1152 492.892 31.971 493.688C30.0362 494.052 28.0414 493.929 26.1657 493.331C24.29 492.733 22.5922 491.679 21.2249 490.263C19.8575 488.846 18.8635 487.112 18.332 485.217C17.8005 483.321 17.7482 481.324 18.1798 479.403C21.3261 478.925 24.5383 479.621 27.205 481.357C27.857 481.745 28.4368 482.243 28.9183 482.829Z"
                  fill="#137C41" />
        <circle cx="32" cy="710" r="32" fill="#137C41" fill-opacity="0" />
                <path
          d="M61.0089 721.126C60.8388 721.144 60.6679 721.101 60.5263 721.005C60.3299 720.947 60.1475 720.849 59.9905 720.717C59.8335 720.585 59.7052 720.423 59.6135 720.24C59.5219 720.056 59.4689 719.856 59.4578 719.652C59.4467 719.447 59.4777 719.242 59.549 719.05C61.2448 713.957 61.4801 708.491 60.2283 703.27C58.9765 698.05 56.2877 693.285 52.4663 689.514C47.5275 684.66 41.0269 681.714 34.1205 681.202C27.2142 680.689 20.3499 682.643 14.7486 686.715C14.5939 686.867 14.4079 686.984 14.2035 687.057C13.9992 687.13 13.7814 687.158 13.5652 687.139C13.3491 687.119 13.1397 687.053 12.9517 686.945C12.7637 686.836 12.6015 686.688 12.4765 686.511C12.3514 686.333 12.2664 686.131 12.2275 685.917C12.1885 685.704 12.1964 685.485 12.2507 685.274C12.305 685.064 12.4044 684.868 12.542 684.701C12.6795 684.533 12.8519 684.397 13.0473 684.302C19.1953 679.732 26.7824 677.525 34.4228 678.086C42.0632 678.646 49.2471 681.936 54.6623 687.355C58.8512 691.558 61.7894 696.842 63.1487 702.618C64.5081 708.394 64.2351 714.434 62.3603 720.064C62.2998 720.373 62.1301 720.651 61.882 720.846C61.634 721.041 61.3241 721.14 61.0089 721.126Z"
          fill="#137C41" />
        <path
          d="M31.9657 742.119C31.2316 742.14 30.4971 742.099 29.7698 741.999C22.0813 741.446 14.8461 738.154 9.37853 732.72C3.88674 727.303 0.583481 720.053 0.0999172 712.354C-0.506457 704.732 1.66177 697.148 6.20522 690.998C6.2998 690.803 6.43574 690.631 6.60363 690.493C6.77152 690.356 6.96733 690.256 7.17746 690.202C7.3876 690.148 7.60705 690.14 7.82056 690.179C8.03407 690.218 8.23652 690.303 8.41391 690.428C8.5913 690.553 8.73937 690.715 8.84782 690.903C8.95627 691.091 9.02253 691.3 9.04198 691.516C9.06143 691.732 9.0336 691.95 8.96046 692.155C8.88731 692.359 8.7706 692.545 8.61838 692.7C4.46164 698.276 2.45081 705.162 2.95354 712.099C3.45628 719.035 6.439 725.559 11.3563 730.478C16.2737 735.397 22.7971 738.381 29.734 738.886C36.6709 739.391 43.5577 737.382 49.1354 733.227C49.2926 733.096 49.475 733 49.6714 732.943C49.8677 732.886 50.0738 732.87 50.2765 732.897C50.4792 732.923 50.6742 732.991 50.8494 733.096C51.0246 733.202 51.1761 733.342 51.2945 733.509C51.4128 733.676 51.4954 733.865 51.5372 734.065C51.5789 734.265 51.5789 734.472 51.537 734.672C51.4952 734.872 51.4124 735.061 51.294 735.228C51.1755 735.395 51.024 735.535 50.8487 735.64C45.4644 739.866 38.8103 742.149 31.9657 742.119Z"
          fill="#137C41" />
        <path
          d="M31.9677 725.891C31.5481 725.882 31.1484 725.711 30.8517 725.414C30.555 725.118 30.3842 724.718 30.375 724.298V716.975C30.4096 716.578 30.5918 716.208 30.8855 715.939C31.1793 715.67 31.5632 715.521 31.9617 715.521C32.3601 715.521 32.7441 715.67 33.0378 715.939C33.3315 716.208 33.5137 716.578 33.5483 716.975V724.298C33.5422 724.717 33.374 725.116 33.0792 725.413C32.7845 725.71 32.386 725.882 31.9677 725.891Z"
          fill="#3C3B3D" />
        <path
          d="M56.8535 728.45C57.493 729.089 57.9285 729.904 58.1049 730.791C58.2814 731.678 58.1908 732.597 57.8447 733.433C57.4985 734.269 56.9124 734.983 56.1604 735.485C55.4084 735.988 54.5243 736.256 53.6198 736.256C52.7154 736.256 51.8313 735.988 51.0793 735.485C50.3272 734.983 49.7411 734.269 49.395 733.433C49.0489 732.597 48.9583 731.678 49.1347 730.791C49.3112 729.904 49.7467 729.089 50.3862 728.45C50.805 728.015 51.3072 727.669 51.8628 727.432C52.4184 727.196 53.016 727.074 53.6198 727.074C54.2236 727.074 54.8212 727.196 55.3769 727.432C55.9325 727.669 56.4347 728.015 56.8535 728.45Z"
          fill="#A5C63B" />
        <path
          d="M13.6503 685.244C14.2898 685.883 14.7254 686.698 14.9018 687.585C15.0782 688.472 14.9877 689.392 14.6415 690.227C14.2954 691.063 13.7093 691.777 12.9573 692.279C12.2053 692.782 11.3211 693.05 10.4167 693.05C9.51227 693.05 8.62815 692.782 7.87614 692.279C7.12412 691.777 6.53798 691.063 6.19186 690.227C5.84574 689.392 5.75518 688.472 5.93161 687.585C6.10804 686.698 6.54356 685.883 7.18307 685.244C7.60183 684.809 8.10405 684.463 8.65967 684.226C9.21529 683.99 9.81289 683.868 10.4167 683.868C11.0205 683.868 11.6181 683.99 12.1737 684.226C12.7294 684.463 13.2316 684.809 13.6503 685.244Z"
          fill="#70993F" />
        <path
          d="M35.743 707.83C33.5889 710.11 32.4074 713.139 32.4491 716.276H32.2077C32.2494 713.139 31.0679 710.11 28.9137 707.83C28.3328 707.265 27.7205 706.733 27.0798 706.237C26.591 704.908 26.3419 703.503 26.3438 702.087C26.3986 700.02 26.9355 697.995 27.9117 696.172C28.8879 694.35 30.2764 692.781 31.9664 691.59C33.6639 692.772 35.0572 694.34 36.0324 696.164C37.0076 697.989 37.5369 700.018 37.577 702.087C37.5959 703.465 37.3459 704.834 36.841 706.117L37.0944 706.358C36.5997 706.973 36.117 707.335 35.743 707.83Z"
          fill="#137C41" />
                <path
          d="M45.632 704.283C46.0637 706.203 46.0114 708.201 45.4799 710.097C44.9484 711.992 43.9543 713.726 42.5869 715.142C41.2196 716.559 39.5219 717.613 37.6462 718.211C35.7705 718.809 33.7756 718.932 31.8408 718.568C31.6986 717.771 31.6139 716.964 31.5874 716.155C31.5381 713.017 32.7207 709.985 34.8814 707.709C35.3021 707.275 35.7537 706.872 36.2328 706.503C39.0015 704.667 42.3345 703.88 45.632 704.283Z"
          fill="#137C41" />
                <path
          d="M28.9183 707.829C31.0725 710.109 32.2539 713.139 32.2123 716.275C32.1959 717.085 32.1152 717.892 31.971 718.688C30.0362 719.052 28.0414 718.929 26.1657 718.331C24.29 717.733 22.5922 716.679 21.2249 715.263C19.8575 713.846 18.8635 712.112 18.332 710.217C17.8005 708.321 17.7482 706.324 18.1798 704.403C21.3261 703.925 24.5383 704.621 27.205 706.357C27.857 706.745 28.4368 707.243 28.9183 707.829Z"
                  fill="#137C41" />
      </svg>

      </div>
      <div class="rotate-main"> 
      <div class="rotate-container">
        ${this.generateRotateBoxesHTML()}
        <div class="rotate-content">
          ${this.generateCenterContentHTML()}
      </div>
      </div>
      </div>
    `;
  }

  setupEventListeners() {
    // 文字点击事件
    const textElements = this.shadowRoot.querySelectorAll('.scroll-text p');
    textElements.forEach((element) => {
      element.addEventListener('click', () => {
        const index = parseInt(element.dataset.index);
        if (index !== this.currentIndex) {
          this.currentIndex = index;
          this.updateContent();
        }
      });
    });

    // 圆形点击事件
    const circles = this.shadowRoot.querySelectorAll('circle');
    circles.forEach((circle, index) => {
      circle.addEventListener('click', () => {
        if (index !== this.currentIndex) {
          this.currentIndex = index;
          this.updateContent();
        }
      });
    });

    // 旋转盒子点击事件
    this.shadowRoot.addEventListener('click', (event) => {
      const rotateBox = event.target.closest('.rotate-box');
      if (rotateBox) {
        const index = parseInt(rotateBox.dataset.index);
        this.updateToolDetails(index);

        // 移除其他盒子的 active 状态
        this.shadowRoot.querySelectorAll('.rotate-box').forEach((box) => {
          box.classList.remove('active');
        });

        // 添加当前盒子的 active 状态
        rotateBox.classList.add('active');
      }
    });

    // 使用节流处理滚动事件
    const throttledWheel = this.throttle((event) => {
      // 移除 preventDefault，因为它会阻止默认滚动行为
      const delta = Math.sign(event.deltaY);
      this.currentIndex =
        (this.currentIndex + delta + this.contents.length) %
        this.contents.length;
      this.updateContent();
    }, this.throttleTimeout);

    this.shadowRoot.addEventListener('wheel', throttledWheel, {
      passive: true, // 将 passive 设置为 true，提高性能
    });
  }

  updateContent() {
    // 更新旋转盒子内容
    const rotateContainer = this.shadowRoot.querySelector('.rotate-container');
    rotateContainer.innerHTML = `
      ${this.generateRotateBoxesHTML()}
      <div class="rotate-content">
        ${this.generateCenterContentHTML()}
      </div>
    `;

    // 更新文字激活状态
    const textElements = this.shadowRoot.querySelectorAll('.scroll-text p');
    textElements.forEach((element, index) => {
      element.classList.toggle('active', index === this.currentIndex);
    });

    // 更新 SVG 路径颜色
    const svgPaths = this.shadowRoot.querySelectorAll('svg path');
    const group1 = [5, 6, 7];
    const group2 = [13, 14, 15];
    const group3 = [21, 22, 23];
    const group4 = [29, 30, 31];

    // 更新各组颜色
    [group1, group2, group3, group4].forEach((group, groupIndex) => {
      group.forEach((pathIndex, colorIndex) => {
        if (svgPaths[pathIndex]) {
          svgPaths[pathIndex].setAttribute(
            'fill',
            this.colors[this.currentIndex][`group${groupIndex + 1}`][colorIndex]
          );
        }
      });
    });

    // 获取所有 path 元素并设置 pointer-events 为 none
    const paths = this.shadowRoot.querySelectorAll('path');
    paths.forEach((path) => {
      path.style.pointerEvents = 'none';
    });

    // 更新圆形透明度
    const circles = this.shadowRoot.querySelectorAll('circle');
    circles.forEach((circle, index) => {
      const textElement = this.shadowRoot.querySelector(
        `.scroll-text p[data-index="${index}"]`
      );
      const isActive = textElement && textElement.classList.contains('active');
      circle.style.fillOpacity = isActive ? '1' : '0';
    });
  }
}
// 返回按钮1
class BackButton extends HTMLElement {
  constructor() {
    super();
    this.attachShadow({ mode: 'open' });
  }

  connectedCallback() {
    this.render();
    this.addEventListeners();
  }

  render() {
    this.shadowRoot.innerHTML = `
      <style>
        .back-btn {
            position: absolute;
            top: 4rem;
            left: 4rem;
            z-index: 20;
          }
        .back-btn img {
          scale: 0.8;
        }
        .back-btn:hover {
          cursor: pointer;
          opacity: 0.7;
        }
      </style>
      <div class="back-btn">
        <img src="../assets/imgs/back-btn.svg" alt="back-btn">
      </div>
    `;
  }

  addEventListeners() {
    const backBtn = this.shadowRoot.querySelector('.back-btn');
    backBtn.addEventListener('click', () => {
      window.history.back();
    });
  }
}
// 返回按钮2
class BackBtn extends HTMLElement {
  constructor() {
    super();
    this.attachShadow({ mode: 'open' });
  }

  connectedCallback() {
    this.render();
    this.addEventListeners();
  }

  render() {
    this.shadowRoot.innerHTML = `
      <style>
        .back-btn {
            position: absolute;
            top: 4rem;
            left: 4rem;
            z-index: 20;
          }
        .back-btn img {
          scale: 0.8;
        }
        .back-btn:hover {
          cursor: pointer;
          opacity: 0.7;
        }
      </style>
      <div class="back-btn">
        <img src="../../assets/imgs/back-btn.svg" alt="back-btn">
      </div>
    `;
  }

  addEventListeners() {
    const backBtn = this.shadowRoot.querySelector('.back-btn');
    backBtn.addEventListener('click', () => {
      window.history.back();
    });
  }
}
customElements.define('back-button', BackButton);
customElements.define('back-btn', BackBtn);
customElements.define('navbar-component', NavbarComponent);
customElements.define('title-component', TitleComponent);
customElements.define(
  'agricultural-change-component',
  AgriculturalChangeComponent
);
customElements.define('plow-detail-item', PlowDetailItem);
customElements.define('rotating-boxes', RotatingBoxes);
